[{"id": 1, "link": "https://zeenews.india.com/mobility/people-sabotaging-tesla-cars-may-go-to-jail-for-up-to-20-years-donald-trump-2875073.html", "source": "Zee News", "title": "People Sabotaging Tesla Cars May Go To Jail For Up To 20 Years: Donald Trump", "summary": "Washington DC: US President Donald Trump said on Friday that people who are caught sabotaging Tesla cars may stand a chance of going to jail..."}, {"id": 2, "link": "https://www.cnbc.com/quotes/TSLA", "source": "CNBC", "title": "Check out Tesla's stock price (TSLA) in real time", "summary": "Get Tesla Inc (TSLA:NASDAQ) real-time stock quotes, news, price and financial information from CNBC."}, {"id": 3, "link": "https://www.newsx.com/tag/tesla-takedown-movement/", "source": "Newsx", "title": "Tesla Takedown Movement", "summary": "Today Tesla Takedown Movement News, Latest Tesla Takedown Movement News, Breaking Tesla Takedown Movement News in English, Latest Tesla Takedown Movement..."}, {"id": 4, "link": "https://www.newsx.com/tag/tesla-protests/", "source": "Newsx", "title": "tesla protests", "summary": "Today tesla protests News, Latest tesla protests News, Breaking tesla protests News in English, Latest tesla protests News Headlines - Newsx."}, {"id": 5, "link": "https://telanganatoday.com/tesla-dealerships-under-attack-in-us-as-musk-takes-up-vital-role-under-trump-administration", "source": "Telangana Today", "title": "Tesla dealerships under attack in US as Musk takes up vital role under Trump administration", "summary": "Attacks on property carrying the logo of Elon Musk's electric-car company are cropping up across the US and overseas."}, {"id": 6, "link": "https://english.mathrubhumi.com/news/world/tesla-vehicles-set-on-fire-in-las-vegas-1.10434633", "source": "Mathrubhumi English", "title": "Several Tesla vehicles torched in Las Vegas; police probe possible arson", "summary": "Las Vegas, NV: The authorities are investigating a suspected arson attack at a Tesla service center in Las Vegas, Nevada,..."}, {"id": 7, "link": "https://www.marketwatch.com/investing/stock/tsla", "source": "MarketWatch", "title": "TSLA Stock Price | Tesla Inc. Stock Quote (U.S.: Nasdaq)", "summary": "TSLA | Complete Tesla Inc. stock news by MarketWatch. View real-time stock prices and stock quotes for a full financial overview."}, {"id": 8, "link": "https://www.aljazeera.com/podcasts/2025/3/21/tesla-takedown-how-elon-musks-trump-alliance-is-triggering-backlash", "source": "Al Jazeera", "title": "‘Tesla Takedown’: How Elon Musk’s Trump alliance is triggering backlash", "summary": "The backlash to Elon Musk and Donald Trump's alliance is hitting Tesla hard. From boycotts and protests to attacks on cars, showrooms and..."}, {"id": 9, "link": "https://www.bbc.com/news/business-61234231", "source": "BBC", "title": "Who is Elon Musk and what is his net worth?", "summary": "The billionaire boss of X (formerly Twitter), Tesla and SpaceX is a controversial figure."}, {"id": 10, "link": "https://www.nasdaq.com/market-activity/stocks/tsla", "source": "Nasdaq", "title": "Tesla, Inc. Common Stock (TSLA)", "summary": "Discover real-time Tesla, Inc. Common Stock (TSLA) stock prices, quotes, historical data, news, and Insights for informed trading and investment decisions."}]