[{"id": 1, "link": "https://www.apple.com/newsroom/", "source": "Apple", "title": "Newsroom", "summary": "The official source for news about Apple, from Apple. Read press releases, get updates, watch video and download images.", "content": ""}, {"id": 2, "link": "https://apps.apple.com/in/app/hindustan-times-news-updates/id1000991178", "source": "Apple", "title": "‎Hindustan Times - News Updates", "summary": "Hindustan Times is one of India's leading English news publications. At HT, we proudly live by the motto, 'First Voice, Last Word' as a testament to 99...", "content": "Hindustan Times is one of Indiaâ\u0080\u0099s leading English news publications. At HT, we proudly live by the motto,â\u0080\u0098First Voice, Last Wordâ\u0080\u0099 as a testament to 99 years of unwavering dedication for credible and expertreportingAccess breaking news, the latest trends & headlines from India & the world on the fast and easy-to-useHindustan Times AppThe HT App offers you a seamless way to follow the latest news related to current affairs, politics, sports,entertainment, business, astrology, lifestyle & local city news, all in one convenient place. Articles byexpert editors guide users on the latest news developments while providing a well-rounded perspectiveon evolving global trendsApart from India, World and Global news HT App also helps you discover news on lifestyle, technology,startups, education, stocks, crypto, UPSC content & moreEnjoy a personalized experience on the app by reading news in your preferred language - English, Hindi,Bangla, Telugu, Marathi, Tamil & KannadaGet a comprehensive coverage on the following:* Weather News: Get updates and forecasts on the weather, Air Quality Index (AQI), Air Pollution, etc* Cricket: Best-in-class cricket coverage including team news, live commentary, live score, expert opinionplayer profiles and tournament schedule. Follow all the major cricket tournaments like IPL, T20 World Cup,Asia Cup, Cricket World Cup, Ashes & bilateral series* Sports News: Catch important domestic & international sports news. In-depth reporting onschedule, results, medal tally & points table for sports such as Tennis, Hockey, Football, AsianGames, Olympics, etc* Astrology News: Read your daily and weekly horoscope prediction to get guidance on your relationshipscareer & wellness* Entertainment: Follow the trending news about your favourite celebrities, actors & film stars fromHollywood, Bollywood, Tollywood, etc. Stay updated about the cast, release dates & reviews of movies, TVseries & shows in all languages - English, Hindi, Korean, Telugu, Tamil, Kannada, etc* Global News: Comprehensive world news coverage and insights into global events, economic trendspolitical engagement & more. Explore the happenings around the world with The Economistâ\u0080\u0094your sourcefor distilled global analysis, curated opinions & exclusive reports* Local News: Stay updated on the news, events and headlines in your surroundings with local citynews for major cities like Delhi, Mumbai, Bengaluru, Gurugram, Noida, Hyderabad, Chennai, Kolkata,Jaipur, Lucknow, Patna, Pune etc* Technology News: Stay informed on the latest innovations and trends in the world of technologyelectronic gadgets & automobilesExperience news in various online formats such as videos, photos, web stories, newsletters, audiopodcast, etc* Quick Reads: Concise bite-sized news updates* ePaper: Read the Hindustan Times daily newspaper on your mobile phone* Live Video - Watch videos of important events such as ISRO Chandrayaan launch, FM Budgetspeech, Parliament sessions, etc* Daily Digest: Top news and trending topics, tailored for your daily briefing* Number Theory & Infographics: Get visually rich, data-driven insights and analysis* HT Brunch & HT Wknd: Dive into lifestyle, culture & more with our exclusive digital magazine* Games: Exercise your mind with our daily classic games like - puzzles, sudoku, crossword andword jumbleEnjoy a wealth of benefits including unlimited access to Hindustan Times e-paper, archives and ad-liteexperience with HT Premium subscription planFor any queries & suggestions, reach out at contact@hindustantimes.comTerms of use: https://www.hindustantimes.com/termsofuseSubscription-Terms of use: https://www.hindustantimes.com/subscriber-agreement-and-terms-of-use Hey! Weâ\u0080\u0099ve added an awesome new features, made the app faster, fixed some bugs, and polished things up.Update now for a smoother, more fun experience! Since many years I have been following the way they organize contents in the news it interests me to read. Recently I went to get a HT but it wasnâ\u0080\u0099t available toh I took the most famous brand but it doesnâ\u0080\u0099t interest at all many times a tried reading but couldnâ\u0080\u0099t find myself much interested as I buy a paper and read it whole week or 4-5 days whenever I get time but. And this review is after 1 hour installing the app. Keep up HT. Be ethical as always:) I have been using TOI app for quite some time but I found TOI is has now downgraded itâ\u0080\u0099s services by being biased and over prided for nothing, flying high for nothing. Now I am using Hindustan Times which is providing every minute news and that too in elaborate manner hence I would recommend HT to general public at large and must stop going for TOI. In Hindustan Times you will find Hinduism and service to Humanity. Go for HT. I am using on the latest version of ios and latest app upgrade. There is no option to personalise scroll feed even for paid subscribers.I donâ\u0080\u0099t want bollywood or to appear in my my feed, yet there is no option to stop it.I can of course choose what to read from the columns headings on top, but the first page scroll feed cannot be modified.Also the text size does not change, despite changing the settings,in the app. One has to go back to the phone settings and change the text size!. The developer,HT Media, indicated that the appâ\u0080\u0099s privacy practices may include handling of data as described below. For more information, see thedeveloperâ\u0080\u0099s privacy policy. The following data may be used to track you across apps and websites owned by other companies: The following data may be collected and linked to your identity: Privacy practices may vary based on, for example, the features you use or your age.LearnÂ More English, Bengali, Telugu Mint News App: Business & More Hindustan - Hindi News, Epaper Desimartini Movies - Ratings and Reviews Indian Express News + Epaper The Hindu : India & World News The Times of India - News App The Economic Times India Today TV English News Copyright Â© 2025Apple Inc.All rights reserved."}, {"id": 3, "link": "https://www.apple.com/macos/macos-sequoia/", "source": "Apple", "title": "macOS Sequoia", "summary": "Lay out your workspace on the fly, browse the web with focus, and even mirror your iPhone wirelessly. And Apple Intelligence helps you simplify and accelerate...", "content": "Lay out your workspace on the fly, browse the web with focus, and even mirror your iPhone wirelessly. And Apple Intelligence helps you simplify and accelerate tasks big and small. On Mac models with Apple silicon, macOS Sequoia introduces Apple Intelligence, which draws on your personal context to give you intelligence that’s most helpful and relevant for you. New Writing Tools and language capabilities help you write, summarize longer text, and prioritize notifications. Create images to express yourself, craft Genmoji for conversations, or revisit favorite moments with your own memory movies. With richer language understanding and expansive product knowledge about your devices, Siri is more helpful than ever. With iPhone Mirroring, you can view what’s on your iPhone and control it too, without having to reach for it.1 Access your iPhone anytime using the iPhone Mirroring app in the Dock. You can fully interact with your iPhone and its apps wirelessly, using your Mac keyboard, trackpad, or mouse. And your iPhone stays locked, so no one else can access it or see what you’re doing. Catch your iPhone notifications right alongside your Mac ones. Even better, you can take action and launch straight into an app when using iPhone Mirroring. Move files, photos, and videos between your iPhone and Mac as easily as you drag and drop between apps on Mac. Drag windows to the edge of your screen to effortlessly arrange them into side-by-side tiles on your desktop, or place them in corners to keep even more apps in view. Lay out your workspace on the fly. Instantly move the app you’re using to a tiled position with dedicated keyboard shortcuts. Holding down the Option key while dragging a window shows you a preview of all your tiling options. And the green button on the top left of each window, along with the menu bar, gives you a quick way to choose from tiling options. See exactly what you’re going to share in video calling apps — your whole screen or a single app — before displaying it for everyone. Express yourself or just hide the laundry behind you with beautiful built-in backgrounds or your own photos, while industry-leading segmentation technology helps you look your best. Quickly pull up relevant info from a site.2 Safari will automatically detect relevant information on a page and highlight it as you browse. Highlights display helpful information like directions and quick links to learn more about people, music, movies, and TV shows. With a table of contents and high-level summary, get the gist of an article before reading on.3 When Safari detects a video on a page, Video Viewer helps you put it front and center, while still giving you full access to system playback controls. From passwords to verifications and security alerts, find them all securely stored in the Passwords app. Backed by secure end-to-end encryption and seamless syncing, the Passwords app safely stores all your credentials. It lets you filter and sort accounts by recently created, credential type, or whether an account is in a shared group, to quickly find accounts you’re looking for. Works across Mac, iPhone, iPad, Apple Vision Pro, and Windows. Access the Passwords app on Mac, iPhone, iPad, and Apple Vision Pro, and on Windows with the iCloud for Windows app. All the passwords sync securely across your devices, and if you use AutoFill, your passwords will automatically be added to the Passwords app. Enjoy new and upcoming titles from game developers taking full advantage of Metal 3 and Apple silicon to deliver smooth frame rates and high-quality visuals. View the collection in the Mac App Store Type with tone, flair, and feeling. In addition to bold, italics, underline, and strikethrough, you can instantly add playful, animated effects to any letter, word, or phrase in iMessage. Or let macOS suggest effects to apply as you type. Whether you want to emphasize some major news, bring your emoji to life, or you’re just blown away, text effects give you new ways to visually amplify your texts. Some words and phrases automatically display a suggestion, and you can also add one of the many new effects to any text. Express yourself in more ways than ever. Now you can send a Tapback with any emoji or sticker, including Live Stickers made from your own photos and stickers from your favorite sticker packs, and quickly access the ones you and your friends use most. Whether it’s too late at night or too important to forget, you can now schedule a message to send at a specified time. Maps now features topographic maps with detailed trail networks and hikes, including all 63 U.S. national parks.4 Browse thousands of hikes that you can save to your other devices — along with any notes you want to add.5 Create your own routes. Create and save custom walking and hiking routes with just a few clicks. Choose different route options, including “one way,” “out and back,“ or a loop. Record audio sessions within your note and generate live audio transcriptions you can search through or combine with other comments, checklists, or documents.6 Crunch numbers, evaluate expressions, and assign variables — right from Notes.7The app solves expressions inline as soon as you type an equals sign.8 In addition to basic math, Math Notes can solve all the same functions as the scientific calculator. You can even assign variables, use them in equations, and then adjust them to see how they affect your results. And you can save your Math Notes to revisit anytime. Simplify and hide text with collapsible section headers, making it easy to manage your most text-heavy notes. Make textstand out with color. With the new highlight style feature, it’s easier to quickly mark up your notes and make text stand out. Say yes with a nod, or no with a shake. With Siri Interactions on AirPods Pro 2, you’ll have the ability to simply nod your head yes or gently shake your head no to respond to Siri.9So if you’re on the bus to work or at home while the baby is sleeping, you can keep Siri working in the background without having to speak out loud. Sound crystal clear on calls, even in windy conditions or areas with loud background noise, through advanced computational audio. The same immersive experience that has transformed music and movies puts you right in the middle of the action of your favorite games.10 Game developers are already using the new API to bring this experience to games with advanced sound design. In addition, voice quality improvements for in-game chat and streaming deliver 16-bit, 48kHz audio and support for dynamic head tracking. And AirPods Pro now deliver our best wireless audio latency ever for mobile gaming, giving you even more of an edge.11 Updated basic and scientific calculators introduce new tools like history and unit conversions. You can also enter and continue to view complete expressions with parentheses, trigonometry, and multiple operations before hitting equals for the final answer. Create, view, edit, and complete reminders from the Reminders app right in Calendar. Scenes let you organize and present your board section by section. Send a copy of your board to anyone with just a link. An improved diagramming mode makes it easier to form connections on your canvas. Align your board content just the way you like by snapping items to the grid. And easily pan around your board by clicking and dragging the canvas while pressing the spacebar. Collections automatically organize your library by helpful topics in the sidebar, like Days, Trips, People and Pets, and Featured Photos. The Feels Like temperature appears prominently near the actual temperature when they differ significantly. You can also add your home and work locations from Contacts to your list of locations in the Weather app. With guest access you can manage how and when people can enter your home.12Add robot vacuum cleaners to the Home app, including in scenes, automations, and Siri requests.13And easily access and understand your home electricity use with new Electricity Usage and Rates features.14 An improved Privacy and Security settings menu makes it easier to manage how much information you’re sharing with apps. Learn more about Mac Learn more about developing for macOS"}, {"id": 4, "link": "https://zeenews.india.com/technology/apple-iphone-15-receives-massive-discount-on-amazon-exchange-cashback-offers-inside-2875262.html", "source": "Zee News", "title": "Apple iphone 15 Receives Massive Discount On Amazon – Exchange & Cashback Offers Inside!", "summary": "The iPhone 15 is designed for durability with a Ceramic Shield front, aluminum frame, and an IP68 rating, making it resistant to dust and...", "content": "The iPhone 15 is designed for durability with a Ceramic Shield front, aluminum frame, and an IP68 rating, making it resistant to dust and water. New Delhi:Thinking about getting the iPhone 15? Here’s some great news for you, E-commerce giant Amazon is offering a huge discount. This will make it easier to own the latest iPhone at a lower price. Plus, you can save even more with cashback and exchange offers.Amazon has dropped the price of the Apple iPhone 15 (128GB) by Rs 18,000. This makes it more affordable than ever. If you trade in your old iPhone 14, you can save up to Rs 27,700. This brings the final price down to just Rs 34,200.iPhone 15 Discount | Exchange & Cashback OffersAmazon has slashed the price of the iPhone 15 (128GB) from Rs 79,900 to Rs 61,900. This makes it a great time to upgrade. If you use an Amazon Pay ICICI credit card, Prime members can enjoy an extra 5 per cent cashback, while non-Prime members still get 3 per cent cashback.Trading in your old iPhone 14 can save you up to Rs 27,700. This brings the final price down to just Rs 34,200.iPhone 15 Features & SpecificationsThe iPhone 15 is designed for durability with a Ceramic Shield front, aluminum frame, and an IP68 rating, making it resistant to dust and water. It features a 6.1-inch Super Retina XDR OLED display with Dynamic Island, Dolby Vision and an 2000 nits peak brightness for a stunning viewing experience.The iphone 15 delivers performance for apps and games powered by Apple’s A16 Bionic chip. It offers storage options of up to 512 GB and runs on iOS 18.2.1 for the latest features.Photography lovers will appreciate the iPhone 15's 48MP main camera and 12MP ultra-wide lens, which also offers 2x telephoto zoom for detailed shots. Selfie fans can capture crisp photos and enjoy clear video calls with the 12MP front camera. Amazon has dropped the price of the Apple iPhone 15 (128GB) by Rs 18,000. This makes it more affordable than ever. If you trade in your old iPhone 14, you can save up to Rs 27,700. This brings the final price down to just Rs 34,200.iPhone 15 Discount | Exchange & Cashback OffersAmazon has slashed the price of the iPhone 15 (128GB) from Rs 79,900 to Rs 61,900. This makes it a great time to upgrade. If you use an Amazon Pay ICICI credit card, Prime members can enjoy an extra 5 per cent cashback, while non-Prime members still get 3 per cent cashback.Trading in your old iPhone 14 can save you up to Rs 27,700. This brings the final price down to just Rs 34,200.iPhone 15 Features & SpecificationsThe iPhone 15 is designed for durability with a Ceramic Shield front, aluminum frame, and an IP68 rating, making it resistant to dust and water. It features a 6.1-inch Super Retina XDR OLED display with Dynamic Island, Dolby Vision and an 2000 nits peak brightness for a stunning viewing experience.The iphone 15 delivers performance for apps and games powered by Apple’s A16 Bionic chip. It offers storage options of up to 512 GB and runs on iOS 18.2.1 for the latest features.Photography lovers will appreciate the iPhone 15's 48MP main camera and 12MP ultra-wide lens, which also offers 2x telephoto zoom for detailed shots. Selfie fans can capture crisp photos and enjoy clear video calls with the 12MP front camera. Amazon has slashed the price of the iPhone 15 (128GB) from Rs 79,900 to Rs 61,900. This makes it a great time to upgrade. If you use an Amazon Pay ICICI credit card, Prime members can enjoy an extra 5 per cent cashback, while non-Prime members still get 3 per cent cashback.Trading in your old iPhone 14 can save you up to Rs 27,700. This brings the final price down to just Rs 34,200.iPhone 15 Features & SpecificationsThe iPhone 15 is designed for durability with a Ceramic Shield front, aluminum frame, and an IP68 rating, making it resistant to dust and water. It features a 6.1-inch Super Retina XDR OLED display with Dynamic Island, Dolby Vision and an 2000 nits peak brightness for a stunning viewing experience.The iphone 15 delivers performance for apps and games powered by Apple’s A16 Bionic chip. It offers storage options of up to 512 GB and runs on iOS 18.2.1 for the latest features.Photography lovers will appreciate the iPhone 15's 48MP main camera and 12MP ultra-wide lens, which also offers 2x telephoto zoom for detailed shots. Selfie fans can capture crisp photos and enjoy clear video calls with the 12MP front camera. Trading in your old iPhone 14 can save you up to Rs 27,700. This brings the final price down to just Rs 34,200.iPhone 15 Features & SpecificationsThe iPhone 15 is designed for durability with a Ceramic Shield front, aluminum frame, and an IP68 rating, making it resistant to dust and water. It features a 6.1-inch Super Retina XDR OLED display with Dynamic Island, Dolby Vision and an 2000 nits peak brightness for a stunning viewing experience.The iphone 15 delivers performance for apps and games powered by Apple’s A16 Bionic chip. It offers storage options of up to 512 GB and runs on iOS 18.2.1 for the latest features.Photography lovers will appreciate the iPhone 15's 48MP main camera and 12MP ultra-wide lens, which also offers 2x telephoto zoom for detailed shots. Selfie fans can capture crisp photos and enjoy clear video calls with the 12MP front camera. The iPhone 15 is designed for durability with a Ceramic Shield front, aluminum frame, and an IP68 rating, making it resistant to dust and water. It features a 6.1-inch Super Retina XDR OLED display with Dynamic Island, Dolby Vision and an 2000 nits peak brightness for a stunning viewing experience.The iphone 15 delivers performance for apps and games powered by Apple’s A16 Bionic chip. It offers storage options of up to 512 GB and runs on iOS 18.2.1 for the latest features.Photography lovers will appreciate the iPhone 15's 48MP main camera and 12MP ultra-wide lens, which also offers 2x telephoto zoom for detailed shots. Selfie fans can capture crisp photos and enjoy clear video calls with the 12MP front camera. The iphone 15 delivers performance for apps and games powered by Apple’s A16 Bionic chip. It offers storage options of up to 512 GB and runs on iOS 18.2.1 for the latest features.Photography lovers will appreciate the iPhone 15's 48MP main camera and 12MP ultra-wide lens, which also offers 2x telephoto zoom for detailed shots. Selfie fans can capture crisp photos and enjoy clear video calls with the 12MP front camera. Photography lovers will appreciate the iPhone 15's 48MP main camera and 12MP ultra-wide lens, which also offers 2x telephoto zoom for detailed shots. Selfie fans can capture crisp photos and enjoy clear video calls with the 12MP front camera. Stay informed on all thelatest news, real-timebreaking newsupdates, and follow all the important headlines inindia newsandworld Newson Zee News."}, {"id": 5, "link": "https://www.apple.com/", "source": "Apple", "title": "Apple", "summary": "Discover the innovative world of Apple and shop everything iPhone, iPad, Apple Watch, Mac, and Apple TV, plus explore accessories, entertainment,...", "content": "Hello, Apple Intelligence. Hello, Apple Intelligence. Thinstant classic. New finish. Never quit. Live healthier. Train better. Stay connected. Sky blue color.Sky high performance with M4. Built for Apple Intelligence. Now supercharged by the M3 chip. Built for Apple Intelligence. Now with a Hearing Aid feature.1 Get up to $1000 in credit on a new iPhone. Trade-in may be required.2 Get $170–$630 in credit when you trade in iPhone 12 or higher.3 Get up to 3% Daily Cash back with every purchase. PGA TOUR Pro Golf Lady Gaga: The Zane Lowe Interview Level Up Your Core Training Strength with Gregg AT&T iPhone 16 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of AT&T trade-in credit applied over 36 months with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, or iPhone 16, and trade-in of eligible smartphone. Receive credit with purchase of an iPhone 16 Pro or iPhone 16 Pro Max of either $1000, $830, or $350 (based upon the model and condition of your trade-in smartphone). Receive credit with purchase of an iPhone 16 of either $800 or $350 (based upon the model and condition of your trade-in smartphone). Max bill credits will not exceed the cost of the device. Requires upgrade of an existing line or activation of a new line and purchase of a new iPhone 16 Pro, iPhone 16 Pro Max, or iPhone 16, on qualifying 36 month 0% APR installment plan, subject to carrier credit qualification. Customers purchasing this offer through Apple cannot add the Next Up Anytime option. $0 down for well qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible AT&T unlimited plan. AT&T may temporarily slow data speeds if the network is busy. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Activation/Upgrade Fee: $35. Trade in device may not be on existing installment plan. Bill credits are applied as a monthly credit over the 36 month installment plan. Credits start within 3 bills. Will receive catchup credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited time offer; subject to change. Limits: one trade-in per qualifying purchase and one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Price for iPhone 16 and iPhone 16 Plus includes $30 AT&T connectivity discount. Activation required. Boost Mobile iPhone 16 Special Deal:Buy an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus and get $1000 in bill credits (not to exceed the cost of the iPhone) applied over 36 months. No trade-in required. If you are trading in a device with this deal, trade-in value will be applied as additional bill credits over 36 months. Monthly price (if shown) reflects net monthly payment, after application of $1000 in bill credit (not to exceed the cost of the iPhone purchased) and trade-in credit (if applicable) applied over 36 months respectively. Requires activation of a new line, Boost Mobile Infinite Access plan and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. After making 12 installment payments, you may upgrade to a new iPhone and get up to $1000 in bill credits (not to exceed the cost of the iPhone) applied over 36 months for the new iPhone on the Infinite Access plan and purchase on new qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. Tax on full retail price due at sale. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Bill credits are applied as a monthly credit over the 36-month installment plan. Trade-in credits start within 3 bills. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combined with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Price for iPhone 16 and iPhone 16 Plus includes $30 Boost Mobile connectivity discount. Activation required. T‑Mobile iPhone 16 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T‑Mobile trade-in credit applied over 24 months with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus and trade-in of eligible smartphone. Existing customers:Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta/MAX, or Essentials plan. Must be an existing T‑Mobile customer. New or Add-a-Line customers:Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a new T‑Mobile customer or adding a new line to an existing T‑Mobile account. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T‑Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T‑Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. Verizon iPhone 16 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of Verizon trade-in credit applied over 36 months with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Existing customers:Customers on an Unlimited Ultimate plan receive $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Customers on an Unlimited Plus plan receive $415 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Must be an existing Verizon customer. New or Add-a-Line customers:Customers on an Unlimited Ultimate plan receive $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Customers on an Unlimited Plus plan receive $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Customers on an Unlimited Welcome plan receive $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Must be a new Verizon customer or adding a new line to an existing Verizon account. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) Verizon monthly bill credits applied over 36 months. Customer must remain in the Verizon Device Payment Program for 36 months to receive the full benefit of the Verizon bill credits. Bill credits may take 1-2 bill cycles to appear. If it takes two cycles for bill credits to appear, you'll see the credit for the first cycle on your second bill in addition to that month's credit. Requires purchase and activation of a new iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus with the Verizon Device Payment Program at 0% APR for 36 months, subject to carrier credit qualification, and iPhone availability and limits. Taxes and shipping not included in monthly price. Sales tax may be assessed on full value of new iPhone. Requires eligible unlimited service plan. Requires trade-in of eligible device in eligible condition. Must be at least 18 to trade-in. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). In-store promotion availability subject to local law; speak to a Specialist to learn more. Limited-time offer; subject to change. Additional terms from Apple, Verizon, and Apple's trade-in partners may apply. Price for iPhone 16 and iPhone 16 Plus includes $30 Verizon connectivity discount. Activation required. AT&T iPhone 15 Special Deal:Buy an iPhone 15 128 GB and get $513.36 in bill credits applied over 36 months. Buy an iPhone 15 256 GB and get $433.36 in bill credits applied over 36 months. Buy an iPhone 15 512 GB and get $453.36 in bill credits applied over 36 months. Requires upgrade of an existing line (or activation of a new line) and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. $0 down for well-qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible AT&T unlimited plan. AT&T may temporarily slow data speeds if the network is busy. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Activation/Upgrade Fee: $35. Bill credits are applied as a monthly credit over the 36-month installment plan. Credits start within 3 bills. Will receive catch-up credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Activation required. T‑Mobile iPhone 15 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T‑Mobile trade-in credit applied over 24 months with purchase of an iPhone 15 or iPhone 15 Plus and trade-in of eligible smartphone. Existing customers:Receive credit with purchase of an iPhone 15 or iPhone 15 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta/MAX, or Essentials plan. Must be an existing T‑Mobile customer. New or Add-a-Line customers:Receive credit with purchase of an iPhone 15 or iPhone 15 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a new T‑Mobile customer or adding a new line to an existing T‑Mobile account. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T‑Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T‑Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. T-Mobile iPhone 14 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T-Mobile trade-in credit applied over 24 months with purchase of an iPhone 14 or iPhone 14 Plus and trade-in of eligible smartphone. Receive credit with purchase of an iPhone 14 or 14 Plus of $800 or $400 for customers on a Go5G Next or Go5G Plus plan (based upon the model and condition of your trade-in smartphone); or $300 or $150 for customers on a Go5G, TMO ONE, TMO ONE Plus, Magenta, Magenta MAX, or Magenta Plus plan (based upon the model and condition of your trade-in smartphone). Offer excludes customers on Go5G Next First Responder, Go5G Plus First Responder, Go5G Next Military, Go5G Plus Military, Go5G Next 55, and Go5G Plus 55 plans. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Price for iPhone 14 and iPhone 14 Plus includes $30 T-Mobile connectivity discount. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. AT&T iPhone SE Special Deal:Buy an iPhone SE 64 GB and get $358.36 in bill credits applied over 36 months. Buy an iPhone SE 128 GB and get $264.36 in bill credits applied over 36 months. Buy an iPhone SE 256 GB and get $184.36 in bill credits applied over 36 months. Requires upgrade of an existing line (or activation of a new line) and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. $0 down for well-qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible AT&T unlimited plan. AT&T may temporarily slow data speeds if the network is busy. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Activation/Upgrade Fee: $35. Bill credits are applied as a monthly credit over the 36-month installment plan. Credits start within 3 bills. Will receive catch-up credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Activation required. T-Mobile iPhone SE 3 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T-Mobile trade-in credit applied over 24 months with purchase of an iPhone SE 3 and trade-in of eligible smartphone. Receive credit with purchase of an iPhone SE 3 of $579 or $400 for customers on a Go5G Next or Go5G Plus plan (based upon the model and condition of your trade-in smartphone); or $300 or $150 for customers on a Go5G, TMO ONE, TMO ONE Plus, Magenta, Magenta MAX, or Magenta Plus plan (based upon the model and condition of your trade-in smartphone). Offer excludes customers on Go5G Next First Responder, Go5G Plus First Responder, Go5G Next Military, Go5G Plus Military, Go5G Next 55, and Go5G Plus 55 plans. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due."}, {"id": 6, "link": "https://www.apple.com/ios/ios-18/", "source": "Apple", "title": "iOS 18", "summary": "iOS 18 makes iPhone even more personal, with deeper customization, new ways to connect, easier-to-find photos, and support for Apple Intelligence.", "content": "Customize your iPhone in more ways than ever, stay connected with friends and family, and relive your favorite moments. And with Apple Intelligence, the things you do every day become even more magical. On all iPhone 16 models, iPhone 15 Pro, and iPhone 15 Pro Max, iOS 18 introduces Apple Intelligence, which draws on your personal context to give you intelligence that’s most helpful and relevant for you. New Writing Tools and language capabilities help you write, summarize longer text, and prioritize notifications. Create images to express yourself, craft Genmoji for conversations, or revisit favorite moments with your own memory movies. With richer language understanding and expansive product knowledge about your devices, Siri is more helpful than ever. Personalize your Home Screen layout. Place your apps and widgets right where you want them. Arrange them along the bottom for quicker reach, or off to the side to frame a favorite wallpaper. Or give each page of your Home Screen a unique layout that’s most helpful for you. App icons and widgets appear even sleeker with a new Dark look. Tint them all with any color, or have iOS suggest a color that complements your wallpaper. You can also make apps and widgets appear larger. Two new ways to protect sensitive apps and the information inside them when others are using your device. Lock an app to require Face ID, Touch ID, or your passcode for access. Information from the app won’t appear in other places across the system, including search and notifications, so others don’t inadvertently see sensitive information. And just as easily hide an app to move it into a hidden apps folder that’s locked. The redesigned Control Center features new groups of controls, which you can access more fluidly with a single, continuous swipe down on the Home Screen. Add more controls from the Controls gallery, which displays all your options in one place, including new controls from your favorite apps. Customize how your controls are laid out, resize them, or build your own groups of controls so they’re always just a swipe away. Swap out yourLock Screen controls. Swap out the controls at the bottom of the Lock Screen for something else — like taking a note when an idea strikes or quickly capturing the moment for your social media. You can even use the Action button on all iPhone 16 models and iPhone 15 Pro to access these new controls. Your entire library. Organized just for you. The new Photos app keeps your library organized and makes it supereasy to find photos fast. Its gorgeous yet familiar look puts everything you want right at your fingertips, so you can spend less time searching and more time enjoying your memories. Collections automatically organizes your library by theme, so you can check out your recent days, people and pets, trips, and more. Reorder Collections and choose items to keep at your fingertips in Pinned Collections, so you can quickly get to the content you care about most, whether that’s photos of your dog or your friends, photos you’ve recently edited, or even screenshots or receipts. In addition to bold, italics, underline, and strikethrough, you can apply playful, animated effects to any letter, word, phrase, or emoji in iMessage — many of which are automatically suggested as you type. Whether you want to emphasize some major news, bring your emoji to life, or you’re just blown away, text effects give you new ways to visually amplify your texts. Some words and phrases automatically display a suggestion, and you can also add one of the many new effects to any text. Express yourself in more ways than ever. Now you can send a Tapback with any emoji or sticker, including Live Stickers made from your own photos and stickers from your favorite sticker packs. Quickly access the ones you and your friends use the most with just a swipe. Stay connected when you’re without Wi-Fi or cellular. With the satellite capabilities on iPhone 14 or later, you can stay connected with friends and family over iMessage or SMS even without cellular or Wi-Fi service. When texting people on iMessage, you’ll also be able to use key features like sending and receiving messages, emoji, and Tapbacks. And all your iMessages sent over satellite are end-to-end encrypted.1 Whether it’s too late at night or too important to forget, you can now schedule a message to send at a specified time. RCS (Rich Communication Services) messages bring richer media and delivery and read receipts for those who don’t use iMessage.2 Have it all sorted out for you.3 Have it all sorted out for you.3 On-device categorization organizes your messages and helps you stay up to date across all your accounts. The Primary category includes your most essential emails — like those from people you know and time-sensitive messages. And the rest of your email will be organized into new categories like Transactions for receipts and order confirmations, Promotions for marketing and sales messages, and Updates for newsletters and everything else. The Primary category helps you focus on what matters most, like time-sensitive messages and emails from friends, family, or colleagues. View snippets of messages like receipts, marketing emails, and newsletters grouped by sender. Safari will automatically detect relevant information on a page and highlight it as you browse. Highlights display helpful information like directions and quick links to learn more about people, music, movies, and TV shows.4 With a table of contents and high-level summary, get the gist of an article before reading on.5 From passwords to verifications and security alerts, find them all securely stored in the Passwords app. Backed by secure end-to-end encryption and seamless syncing, the Passwords app safely stores all your credentials. It lets you filter and sort accounts by recently created, credential type, or whether an account is in a shared group, to quickly find accounts you’re looking for. Works across iPhone, iPad, Mac,Apple Vision Pro,and Windows. Access the Passwords app on iPhone, iPad, Mac, and Apple Vision Pro, and on Windows with the iCloud for Windows app. All the passwords sync securely across your devices, and if you use AutoFill, your passwords will automatically be added to the Passwords app. Download the lay of the land.6 Maps now features topographic maps with detailed trail networks and hikes, including all 63 U.S. national parks. Save maps to your device to access offline with turn-by-turn voice guidance, or create your own hikes. Browse thousands of hikes that you can save to your device — along with any notes you want to add.7 Create your own routes. Create and save custom walking and hiking routes with just a few taps. Choose different route options, including “one way,” “out andback,“or a loop. Game Mode minimizes background activity to sustain consistently high frame rates for hours of continuous gameplay. Game Mode dramatically reduces audio latency with AirPods, and makes wireless game controllers incredibly responsive.8 Game Mode improves in-game responsiveness by doubling the Bluetooth polling rate with wireless controllers, giving you an edge you can feel right away. It also reduces audio latency when using AirPods.8And Personalized Spatial Audio is enabling game developers to create an immersive soundstage, putting players in the middle of the action like never before.9 Bring iPhone devices together to pay privately.10 Whether you’re at a garage sale or paying someone back for dinner, Tap to Cash makes in-person payments quick and easy without having to share phone numbers or email addresses. Securely authenticate with Face ID, Touch ID, or passcode, then bring your devices together to send Apple Cash. Pay using rewards or pay in installments.11 View your rewards or points balance in Wallet and redeem points with Apple Pay online and in apps. You can also easily access installment financing options from your bank. Redesigned event tickets bring new features, including an event guide combining helpful information about the venue with recommendations from Apple apps.12 Say yes with a nod, or no with a shake. With Siri Interactions on AirPods Pro 2, you’ll have the ability to simply nod your head yes or gently shake your head no to respond to Siri.13So if you’re on the bus to work or at home while the baby is sleeping, you can keep Siri working in the background without having to speak out loud. Sound crystal clear on calls, even in windy conditions or areas with loud background noise, through advanced computational audio. The same immersive experience that has transformed music and movies puts you right in the middle of the action of your favorite games.9 Game developers are already using the new API to bring this experience to games with advanced sound design — like Need for Speed: Mobile by Tencent Games and EA coming this fall. In addition, voice quality improvements for in-game chat and streaming deliver 16-bit, 48kHz audio and support for dynamic head tracking.8And AirPods Pro now deliver our best wireless audio latency ever for mobile gaming, giving you even more of an edge.8 Record audio sessions within your note and generate live audio transcriptions you can search through or combine with other comments, checklists, or documents.14 Enter an expression and have it solved instantly while typing.15 Simplify and hide text with collapsible section headers, making it easy to manage your most text-heavy notes. Make textstand out with color. With the new highlight style feature, it’s easier to quickly mark up your notes and make text stand out. Log your state of mind in the Journal app. You can also automatically add the time you spent journaling as mindful minutes in the Health app. View your writing streaks, a calendar with existing entries, and other fun stats to stay on top of your journaling goals. Easily find past entries with the ability to sort your journal and use Search to find exactly what you’re looking for. Add widgets for writing prompts or streaks. It’s even easier to reflect on the present moment. Add a widget to your Home Screen or Lock Screen with writing prompts that change throughout the day. Or add a widget to track your current streak. Select InSight in the Apple TV app to learn more about the actors and music as it all plays out onscreen.16InSight will also be available when using iPhone as a remote control for Apple TV 4K, perfect for when you’re watching with others. StreamPalm Royaleon the Apple TV app with a subscription. Tune in to the whole conversation. Enhance Dialogue helps you better hear what’s being said onscreen, especially when loud sound effects or music is playing. It’s now available on recent iPhone and iPad models when playing through the built-in speakers, wired headphones, AirPods, or other Bluetooth-connected speakers and headphones.17Enhance Dialogue applies machine learning and computational audio to deliver incredible vocal clarity by actively detecting speech across audio channels. So now even whispers are heard more clearly amid the music and background sounds of your favorite movies and shows. Guest access helps you manage how and when people can enter your home, providing access to the garage openers, alarm systems, and door locks you select, at the times you choose.18 Magically unlock doors as you approach, simply by carrying iPhone in a bag or pocket or wearing Apple Watch.19 Ask Siri to cleanthe floors. The Home app now supports the core functionality of robot vacuum cleaners, such as power control, cleaning mode, vacuum, mop, and charge status. They can also participate in automations and scenes, and respond to Siri requests. So you can add them to your cleaning routines — or tell Siri to do some spot cleaning in the living room. Easily access and understand your home electricity usage right from the Home app. Eligible Pacific Gas and Electric Company customers can connect their utility account to view their electricity usage and rate plan information.20 Decide which contacts to share with an app, rather than giving it access to all your contacts. Or give the app access only to those you message and call most. An improved Privacy and Security settings menu makes it easier to manage how much information you’re sharing with apps. Pair accessories with greater privacy. App developers will be able to offer an intuitive new way to pair accessories while protecting information about your nearby Bluetooth devices. Eye Tracking makes it possible for people to control iPhone with just their eyes.21Music Haptics syncs the iPhone Taptic Engine with the rhythm of songs so those who are deaf or hard of hearing can enjoy the Apple Music catalog.22And Vocal Shortcuts helps people with severe atypical speech record sounds that trigger specific actions on iPhone. Access the all-new Math Notes calculator, a new portrait orientation for the scientific calculator, and other new features like unit conversion and history. A redesigned month view makes it easier to get an overview of your month ahead. And you can create, view, edit, and complete reminders from the Reminders app right in Calendar. Scenes let you organize and present your board section by section. Send a copy of your board to anyone with just a link. An improved diagramming mode makes it easier to form connections on your canvas. And align your board content just the way you like by snapping items to the grid. With enhanced screen sharing capabilities, you can draw on someone’s screen so they can see what they can do on theirs, or control their screen and take actions yourself. Share streaming video and recorded media during emergency calls. During a call, participating emergency dispatchers will send you a request to share live video or photos over a secure connection, making it easier and faster to get the help you need. A new design lets you jump right into a personalized selection of workouts or meditations. The For You tab elevates activities based on preferred trainers, durations, and music. And an all-new search feature makes it easy to find exactly what you love. Record and transcribe a live call directly from the Phone app.23You can also search call history more easily, dial smarter, and switch SIM cards seamlessly. Learn more about iPhone Learn more about developing for iOS"}, {"id": 7, "link": "https://www.apple.com/newsroom/2024/12/apple-intelligence-now-features-image-playground-genmoji-and-more/", "source": "Apple", "title": "Apple Intelligence now features Image Playground, Genmoji, and more", "summary": "Today also marks the beginning of Apple Intelligence language expansion with localized English support for Australia, Canada, Ireland,...", "content": "Text of this article December 11, 2024 Apple Intelligence now features Image Playground, Genmoji, Writing Tools enhancements, seamless support for ChatGPT, and visual intelligence Today also marks the beginning of Apple Intelligence language expansion with localized English support for Australia, Canada, Ireland, New Zealand, South Africa, and the U.K. CUPERTINO, CALIFORNIAApple today announced the release of iOS 18.2, iPadOS 18.2, and macOS Sequoia 15.2, introducing a brand-new set ofApple Intelligencefeatures that will elevate users’ experience with iPhone, iPad, and Mac, and builds on thefirst set of capabilitiesalready introduced. Apple Intelligence is the easy-to-use personal intelligence system that delivers helpful and relevant intelligence while taking an extraordinary step forward for privacy in AI. Now users can explore creative new ways to express themselves visually with Image Playground, create the perfect emoji for any situation with Genmoji, and make their writing even more dynamic with new enhancements to Writing Tools. Building on Apple Intelligence, users with an iPhone 16 or iPhone 16 Pro can instantly learn more about their surroundings with visual intelligence with Camera Control. And now with ChatGPT integrated into Writing Tools and Siri, users can tap into ChatGPT’s expertise without having to switch between apps, helping them get things done faster and easier than ever before. Today, Apple Intelligence also begins language expansion with localized English support for Australia, Canada, Ireland, New Zealand, South Africa, and the U.K., giving even more users around the world powerful new ways to use their iPhone, iPad, and Mac. Additional languages, including Chinese, English (India), English (Singapore), French, German, Italian, Japanese, Korean, Portuguese, Spanish, and Vietnamese will be coming throughout the year, with an initial setarriving in a software update in April. Design Fun, Original Images with Image Playground The Image Playground experience allows users to easily create fun and unique images, with concepts like themes, costumes, accessories, and places. Users can add their own text descriptions, and can even create images in the likeness of a family member or friend using photos from their photo library. Image Playground generates images in distinct styles, including Animation — a modern, 3D-animated look — and Illustration, which offers images with simple shapes, clear lines, and colorblocking. The experience is integrated right into Messages, making it easier than ever to create images for conversations, as well as into apps like Freeform, Keynote, and many others. Image Playground is also available as a brand-new dedicated app. Create Genmoji to Fit Any Moment With the power of Apple Intelligence, emoji is taken to the next level with Genmoji, making conversations with family and friends more fun and playful, and opening up entirely new ways to communicate. By simply typing a description into the emoji keyboard, a Genmoji will appear, including multiple options to choose from. With images from their photo library, users can take Genmoji even further by creating one that is inspired by a friend or family member. Personalized Genmoji can be customized with accessories, like a hat or sunglasses, and can reflect themes or activities to make them even more personal and unique. Just like emoji, Genmoji can be added inline to messages, or shared as a sticker or reaction in a Tapback.1 Take Notes to the Next Level with Image Wand The Notes app gets new tools to make note-taking more visual and dynamic. With Image Wand in the tool palette, users can quickly create images in their note using the written or visual context already captured within the note. Image Wand transforms a rough sketch into a polished image by simply circling it. Users can even circle empty space within a note, and Image Wand will gather context from the surrounding area — using on-device generative models to analyze the handwritten or typed text — to create a relevant image that complements the note and makes it more visual. Users can create images with the Animation, Illustration, and an additional Sketch style in Image Wand. Describe Changes in Writing Tools Writing Tools build on the existing options of Rewrite, Proofread, and Summarize with the new ability for users to specify the change they’d like to make, using the new Describe Your Change option. Describe Your Change gives users even more flexibility and control when they’d like to make their writing sound more expressive, such as to add more dynamic action words to their resume or even rewrite a dinner party invitation in the form of a poem, and more. Just like all of the features with Writing Tools, this new Describe Your Change option is available systemwide across Apple and many third-party apps. Learn More About Surroundings in One Click with Visual Intelligence A new visual intelligence experience builds on Apple Intelligence and helps users learn about objects and places instantly, thanks to the new Camera Control on the iPhone 16 lineup. Visual intelligence can summarize and copy text, translate text between languages, detect phone numbers or email addresses with the option to add to contacts, and more. Camera Control also allows users to search Google so they can see where they can buy an item, or benefit from ChatGPT’s problem-solving skills to ask for an explanation about a complex diagram, such as from class notes. Users are in control of when third-party tools are used and what information is shared. Tap into ChatGPT with Siri and Writing Tools Apple is enabling ChatGPT access in Siri and Writing Tools experiences within iOS, iPadOS, and macOS, allowing users to access its expertise — as well as its image- and document-understanding capabilities — without needing to jump between applications. With the ChatGPT integration, Siri can suggest a user access ChatGPT for certain requests, and Siri can provide the response directly. With Compose, users can ask ChatGPT to generate content for anything they are writing about from the systemwide Writing Tools. They can also use ChatGPT’s image-generation capabilities to add images alongside their written content. Users can choose whether to enable ChatGPT integration, and are in full control of when to use it and what information is shared with ChatGPT. By default, a ChatGPT account is not required to use this integration. When using ChatGPT without an account, OpenAI will not store requests, and will not use the data for model training. Additionally, users’ IP addresses are obscured to prevent their sessions from being linked together. For those who choose to connect their account, OpenAI’s data-use policies apply. Even More Capabilities Coming Soon Additional Apple Intelligence capabilities will be available in the months to come. Siri will be even more capable, with the ability to draw on a user’s personal context to deliver intelligence that’s tailored to them. Siri will also gain onscreen awareness, and will be able to take hundreds of new actions in and across Apple and third-party apps. Priority Notifications will also surface what’s most important. In addition, users will be able to create images in Image Playground in a Sketch style, an academic and highly detailed style that uses a vibrant color palette combined with technical lines to produce realistic drawings. A Breakthrough for Privacy in AI Designed to protect users’ privacy at every step, Apple Intelligence uses on-device processing, meaning that many of the models that power it run entirely on device. For requests that require access to larger models, Private Cloud Compute extends the privacy and security of iPhone into the cloud to unlock even more intelligence. When using Private Cloud Compute, users’ data is never stored or shared with Apple; it is used only to fulfill their request. Independent experts can inspect the code that runs on Apple silicon servers to continuously verify this privacy promise, and are already doing so. This is an extraordinary step forward for privacy in AI. nhaija@apple.com Apple Media Helpline media.help@apple.com Images in this article Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple’s six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple’s more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it. nhaija@apple.com Apple Media Helpline media.help@apple.com The latest news and updates,direct from Apple."}, {"id": 8, "link": "https://apps.apple.com/us/app/cgtn/id922456579", "source": "Apple", "title": "‎CGTN", "summary": "CGTN is committed to providing worldwide audience with a wide range of global news from a different perspective. The app prioritizes user...", "content": "CGTN is committed to providing worldwide audience with a wide range of global news from a different perspective. The app prioritizes user experience with intricate details. It brings diverse, balanced and objective content for global users, and presents a true image of China and world from multiple perspectives.The latest version of the CGTN app supports five languages: English, Spanish, French, Arabic and Russian. It features a wide array of original content, including breaking news, in-depth stories and livestreams. The app also hosts a comprehensive archive of original articles, audio, video, and TV shows covering topics across politics, business, technology, science, sports, nature, culture and others. It gives you access to all the trusted information you need on the go.Features:â\u0080\u0093 Exclusive coverage of China and world news, original TV shows and feature stories, continuous updates about worldwide eventsâ\u0080\u0093 Content in five languages: English, Spanish, French, Arabic and Russianâ\u0080\u0093 Rich audiovisual content, including videos, podcasts, livestreams and TV showsâ\u0080\u0093 Enhanced reading experienceâ\u0080\u0093 Notifications to ensure you never miss breaking news and exciting featuresâ\u0080\u0093 Search for related and hot news to deepen understandingâ\u0080\u0093 Like, save and share your favorite stories on social mediaâ\u0080\u0093 AI and AR productsâ\u0080\u0093 No ads. No in-app purchases.Download the CGTN app to join millions of our subscribers and enjoy personalized, hassle-free news and audiovisual content. The CGTN app now comes with Apple CarPlay, so you can enjoy audio articles, podcasts, radio and TV on the road. I love the new layout, but there is just one problem.My iPad doesnâ\u0080\u0099t get push notifications despite me setting that up and I have the same app on my iPhone and it DOES give me push notifications, which, I have set up.I guess my advice is: please bring back push notifications for iPad. I downloaded the app yesterday after reading a story on Facebook by CTGN. The first thing that made me wonder did I download an ad blocker on my phone? No. Who sponsored this so that it was ad free? I guess the Chinese Govt. If that is what they do, and I get to read various news stories without ads ever, I LOVE it! I can not even begin to tell you how many stories I just stop reading because hundreds of ads, accidentally clicking on them and getting frustrated because I can not get back to the story. I am so over being bombarded by ads of products I would never buy. Thanks for a clean news source.Is their anyway to add weather to it? I would never have to go anyplace else. I am in the USA so it would be great. Thanks again.Just to be clear no fees? No monthly sub? And no ads? Where has this kind of news been? Nice app, pleasing to view. Lots of news groups have these things, why use this one? Living in the USA I find myself more and more disdainful of the inept, highly opinionated and barefaced biases found on all the major (and lesser!) news sources here and western countries in general. They all have pretty apps too. Iâ\u0080\u0099m still in the first few days of trying this CGTN, hoping to find less opinions and just the facts. I can form my own opinions. So far itâ\u0080\u0099s going ok. The opinion articles are clearly labeled as such in the headline. The live TV feature works well. So far my personal jury is still out as to whether or not CGTN will deliver the news in the manner Iâ\u0080\u0099m seeking but Iâ\u0080\u0099m giving them a good try and hoping for the best. Best of luck to them and thanks for their hard work.Update after using a while...Seeing many of the usual biases on USA reports. They parrot U.S. msm sources. Noticed the last story read was actually an AP story. I must assume the reports on China are similarly slanted. Deleted from device. The developer,China Global Television Network Corp., indicated that the appâ\u0080\u0099s privacy practices may include handling of data as described below. For more information, see thedeveloperâ\u0080\u0099s privacy policy. The following data may be collected and linked to your identity: The following data may be collected but it is not linked to your identity: Privacy practices may vary, for example, based on the features you use or your age.LearnÂ More English, Arabic, French, Russian, Spanish South China Morning Post: News Copyright Â© 2025Apple Inc.All rights reserved."}, {"id": 9, "link": "https://zeenews.india.com/technology/google-pixel-9a-india-launch-flipkart-with-ai-features-priced-lower-than-apples-iphone-16e-check-specs-and-price-2874488.html", "source": "Zee News", "title": "Google Pixel 9a Launched In India With AI Features, Priced Lower Than Apples iPhone 16e; Check Specs And Price", "summary": "Google Pixel 9a India Launch: The new-generation Pixel 9a expands Googles Pixel lineup, joining flagship models like the Pixel 9, 9 Pro,...", "content": "Google Pixel 9a India Launch:The new-generation Pixel 9a expands Google's Pixel lineup, joining flagship models like the Pixel 9, 9 Pro, 9 Pro XL, and Pixel 9 Pro Fold as a more budget-friendly option. Google Pixel 9a India Launch:Google has officially launched the Pixel 9a in India, making it the most affordable member of the Pixel 9 series. The Google Pixel 9a is more affordable than Apple’s iPhone 16e and runs on Android 15. Google promises seven years of OS, security, and Pixel Drop updates.Notably, the Apple's iPhone 16e comes in three variants — 128GB, 256GB, and 512GB storage capacities, starting at Rs 59,900. The smartphone comes in white and black colour options.The Pixel 9a is a dual SIM (Nano+eSIM) smartphone is available in four colour options: Iris, Obsidian, Peony, and Porcelain. Google has packed the Pixel 9a with several AI-powered camera features, including Macro Focus, Add Me, Night Sight, Reimagine, Magic Eraser, Best Take, Photo Unblur, and Portrait Light. Adding further, it comes with built-in support for Google Gemini, just like the company’s flagship Pixel 9 Pro.For 4 years running, Google's Pixel has stood out thanks in part to its bold industrial design. But with the new Pixel 9a, the bar has been lowered -- or actually, eliminated entirely. Google says this was done to make the phone more pocketable. But it also makes the 9a blend…pic.twitter.com/84VSn26bCJ— Michael Fisher (@Captain2Phones)March 19, 2025The new-generation Pixel 9a expands Google's Pixel lineup, joining flagship models like the Pixel 9, 9 Pro, 9 Pro XL, and Pixel 9 Pro Fold as a more budget-friendly option. Despite its affordability, the Pixel 9a boasts flagship-level features, including the Tensor G4 chipset, a dual-camera setup with AI enhancements, and built-in Gemini assistance.Google Pixel 9a Price In India And AvailabilityThe Pixel 9a is priced at Rs 49,999 for the 8GB+128GB variant, while the 8GB+256GB model costs Rs 56,999. The smartphone will go on sale in April through Flipkart, Croma, Vijay Sales, and other major retailers.Google Pixel 9a SpecificationsThe Pixel 9a sports a 6.3-inch Actua display with a resolution of 1080 x 2424 pixels. It offers up to 1800 nits of HDR brightness and a peak brightness of 2700 nits, ensuring clear visibility even in bright sunlight. The phone is powered by the device is a 5100mAh battery, delivering over 30 hours of battery life on a single charge.For photography, the Pixel 9a features a dual rear camera setup, including a 48MP wide camera with OIS and 8X Super Res Zoom (digital zoom), along with a 13MP ultra-wide camera offering a 120-degree field of view. On the front, there’s a 13MP selfie camera with a 96.1-degree ultrawide field of view.The display is protected by Corning Gorilla Glass 3, and the phone comes with an IP68 rating for dust and water resistance. For security, the Pixel 9a includes features like Emergency SOS, Crisis Alerts, Car Crash Detection, Earthquake Alerts, and Theft Protection. Notably, the Apple's iPhone 16e comes in three variants — 128GB, 256GB, and 512GB storage capacities, starting at Rs 59,900. The smartphone comes in white and black colour options.The Pixel 9a is a dual SIM (Nano+eSIM) smartphone is available in four colour options: Iris, Obsidian, Peony, and Porcelain. Google has packed the Pixel 9a with several AI-powered camera features, including Macro Focus, Add Me, Night Sight, Reimagine, Magic Eraser, Best Take, Photo Unblur, and Portrait Light. Adding further, it comes with built-in support for Google Gemini, just like the company’s flagship Pixel 9 Pro.For 4 years running, Google's Pixel has stood out thanks in part to its bold industrial design. But with the new Pixel 9a, the bar has been lowered -- or actually, eliminated entirely. Google says this was done to make the phone more pocketable. But it also makes the 9a blend…pic.twitter.com/84VSn26bCJ— Michael Fisher (@Captain2Phones)March 19, 2025The new-generation Pixel 9a expands Google's Pixel lineup, joining flagship models like the Pixel 9, 9 Pro, 9 Pro XL, and Pixel 9 Pro Fold as a more budget-friendly option. Despite its affordability, the Pixel 9a boasts flagship-level features, including the Tensor G4 chipset, a dual-camera setup with AI enhancements, and built-in Gemini assistance.Google Pixel 9a Price In India And AvailabilityThe Pixel 9a is priced at Rs 49,999 for the 8GB+128GB variant, while the 8GB+256GB model costs Rs 56,999. The smartphone will go on sale in April through Flipkart, Croma, Vijay Sales, and other major retailers.Google Pixel 9a SpecificationsThe Pixel 9a sports a 6.3-inch Actua display with a resolution of 1080 x 2424 pixels. It offers up to 1800 nits of HDR brightness and a peak brightness of 2700 nits, ensuring clear visibility even in bright sunlight. The phone is powered by the device is a 5100mAh battery, delivering over 30 hours of battery life on a single charge.For photography, the Pixel 9a features a dual rear camera setup, including a 48MP wide camera with OIS and 8X Super Res Zoom (digital zoom), along with a 13MP ultra-wide camera offering a 120-degree field of view. On the front, there’s a 13MP selfie camera with a 96.1-degree ultrawide field of view.The display is protected by Corning Gorilla Glass 3, and the phone comes with an IP68 rating for dust and water resistance. For security, the Pixel 9a includes features like Emergency SOS, Crisis Alerts, Car Crash Detection, Earthquake Alerts, and Theft Protection. The Pixel 9a is a dual SIM (Nano+eSIM) smartphone is available in four colour options: Iris, Obsidian, Peony, and Porcelain. Google has packed the Pixel 9a with several AI-powered camera features, including Macro Focus, Add Me, Night Sight, Reimagine, Magic Eraser, Best Take, Photo Unblur, and Portrait Light. Adding further, it comes with built-in support for Google Gemini, just like the company’s flagship Pixel 9 Pro.For 4 years running, Google's Pixel has stood out thanks in part to its bold industrial design. But with the new Pixel 9a, the bar has been lowered -- or actually, eliminated entirely. Google says this was done to make the phone more pocketable. But it also makes the 9a blend…pic.twitter.com/84VSn26bCJ— Michael Fisher (@Captain2Phones)March 19, 2025The new-generation Pixel 9a expands Google's Pixel lineup, joining flagship models like the Pixel 9, 9 Pro, 9 Pro XL, and Pixel 9 Pro Fold as a more budget-friendly option. Despite its affordability, the Pixel 9a boasts flagship-level features, including the Tensor G4 chipset, a dual-camera setup with AI enhancements, and built-in Gemini assistance.Google Pixel 9a Price In India And AvailabilityThe Pixel 9a is priced at Rs 49,999 for the 8GB+128GB variant, while the 8GB+256GB model costs Rs 56,999. The smartphone will go on sale in April through Flipkart, Croma, Vijay Sales, and other major retailers.Google Pixel 9a SpecificationsThe Pixel 9a sports a 6.3-inch Actua display with a resolution of 1080 x 2424 pixels. It offers up to 1800 nits of HDR brightness and a peak brightness of 2700 nits, ensuring clear visibility even in bright sunlight. The phone is powered by the device is a 5100mAh battery, delivering over 30 hours of battery life on a single charge.For photography, the Pixel 9a features a dual rear camera setup, including a 48MP wide camera with OIS and 8X Super Res Zoom (digital zoom), along with a 13MP ultra-wide camera offering a 120-degree field of view. On the front, there’s a 13MP selfie camera with a 96.1-degree ultrawide field of view.The display is protected by Corning Gorilla Glass 3, and the phone comes with an IP68 rating for dust and water resistance. For security, the Pixel 9a includes features like Emergency SOS, Crisis Alerts, Car Crash Detection, Earthquake Alerts, and Theft Protection. For 4 years running, Google's Pixel has stood out thanks in part to its bold industrial design. But with the new Pixel 9a, the bar has been lowered -- or actually, eliminated entirely. Google says this was done to make the phone more pocketable. But it also makes the 9a blend…pic.twitter.com/84VSn26bCJ— Michael Fisher (@Captain2Phones)March 19, 2025 The new-generation Pixel 9a expands Google's Pixel lineup, joining flagship models like the Pixel 9, 9 Pro, 9 Pro XL, and Pixel 9 Pro Fold as a more budget-friendly option. Despite its affordability, the Pixel 9a boasts flagship-level features, including the Tensor G4 chipset, a dual-camera setup with AI enhancements, and built-in Gemini assistance.Google Pixel 9a Price In India And AvailabilityThe Pixel 9a is priced at Rs 49,999 for the 8GB+128GB variant, while the 8GB+256GB model costs Rs 56,999. The smartphone will go on sale in April through Flipkart, Croma, Vijay Sales, and other major retailers.Google Pixel 9a SpecificationsThe Pixel 9a sports a 6.3-inch Actua display with a resolution of 1080 x 2424 pixels. It offers up to 1800 nits of HDR brightness and a peak brightness of 2700 nits, ensuring clear visibility even in bright sunlight. The phone is powered by the device is a 5100mAh battery, delivering over 30 hours of battery life on a single charge.For photography, the Pixel 9a features a dual rear camera setup, including a 48MP wide camera with OIS and 8X Super Res Zoom (digital zoom), along with a 13MP ultra-wide camera offering a 120-degree field of view. On the front, there’s a 13MP selfie camera with a 96.1-degree ultrawide field of view.The display is protected by Corning Gorilla Glass 3, and the phone comes with an IP68 rating for dust and water resistance. For security, the Pixel 9a includes features like Emergency SOS, Crisis Alerts, Car Crash Detection, Earthquake Alerts, and Theft Protection. The Pixel 9a is priced at Rs 49,999 for the 8GB+128GB variant, while the 8GB+256GB model costs Rs 56,999. The smartphone will go on sale in April through Flipkart, Croma, Vijay Sales, and other major retailers.Google Pixel 9a SpecificationsThe Pixel 9a sports a 6.3-inch Actua display with a resolution of 1080 x 2424 pixels. It offers up to 1800 nits of HDR brightness and a peak brightness of 2700 nits, ensuring clear visibility even in bright sunlight. The phone is powered by the device is a 5100mAh battery, delivering over 30 hours of battery life on a single charge.For photography, the Pixel 9a features a dual rear camera setup, including a 48MP wide camera with OIS and 8X Super Res Zoom (digital zoom), along with a 13MP ultra-wide camera offering a 120-degree field of view. On the front, there’s a 13MP selfie camera with a 96.1-degree ultrawide field of view.The display is protected by Corning Gorilla Glass 3, and the phone comes with an IP68 rating for dust and water resistance. For security, the Pixel 9a includes features like Emergency SOS, Crisis Alerts, Car Crash Detection, Earthquake Alerts, and Theft Protection. The Pixel 9a sports a 6.3-inch Actua display with a resolution of 1080 x 2424 pixels. It offers up to 1800 nits of HDR brightness and a peak brightness of 2700 nits, ensuring clear visibility even in bright sunlight. The phone is powered by the device is a 5100mAh battery, delivering over 30 hours of battery life on a single charge.For photography, the Pixel 9a features a dual rear camera setup, including a 48MP wide camera with OIS and 8X Super Res Zoom (digital zoom), along with a 13MP ultra-wide camera offering a 120-degree field of view. On the front, there’s a 13MP selfie camera with a 96.1-degree ultrawide field of view.The display is protected by Corning Gorilla Glass 3, and the phone comes with an IP68 rating for dust and water resistance. For security, the Pixel 9a includes features like Emergency SOS, Crisis Alerts, Car Crash Detection, Earthquake Alerts, and Theft Protection. For photography, the Pixel 9a features a dual rear camera setup, including a 48MP wide camera with OIS and 8X Super Res Zoom (digital zoom), along with a 13MP ultra-wide camera offering a 120-degree field of view. On the front, there’s a 13MP selfie camera with a 96.1-degree ultrawide field of view.The display is protected by Corning Gorilla Glass 3, and the phone comes with an IP68 rating for dust and water resistance. For security, the Pixel 9a includes features like Emergency SOS, Crisis Alerts, Car Crash Detection, Earthquake Alerts, and Theft Protection. The display is protected by Corning Gorilla Glass 3, and the phone comes with an IP68 rating for dust and water resistance. For security, the Pixel 9a includes features like Emergency SOS, Crisis Alerts, Car Crash Detection, Earthquake Alerts, and Theft Protection. Stay informed on all thelatest news, real-timebreaking newsupdates, and follow all the important headlines inindia newsandworld Newson Zee News."}, {"id": 10, "link": "https://www.apple.com/store", "source": "Apple", "title": "Store.", "summary": "Shop the latest Apple products, accessories and offers. Compare models, get expert shopping help, plus flexible payment and delivery options.", "content": "Enjoytwo-hour deliveryfrom an Apple Store,free delivery, oreasy pickup.Footnote² Trade in your current device.Get credit toward a new one.Footnote³ Pay in full orpay over time.Your choice. Get apersonalized shoppingexperience in theApple Store app. Make them yours.Engrave a mix of emoji, names, and numbers for free. Customizeyour Mac and create your own style of Apple Watch. Six Apple services. One easy subscription. ∆ Apple Intelligence is available in beta on all iPhone 16 models, iPhone 15 Pro, iPhone 15 Pro Max, iPad mini (A17 Pro), and iPad and Mac models with M1 and later, with Siri and device language set to English (Australia, Canada, Ireland, New Zealand, South Africa, UK or US), as part of an iOS 18, iPadOS 18 and macOS Sequoia software update. Additional features and Chinese (Simplified), English (India, Singapore), French, German, Italian, Japanese, Korean, Portuguese (Brazil) and Spanish language support available in early April, with more languages coming over the course of the year, including Vietnamese. Some features may not be available in all regions or languages. * Pricing for iPhone 16 and iPhone 16 Plus includes a $30 connectivity discount that requires activation with AT&T, Boost Mobile, T-Mobile, or Verizon. Financing available to qualified customers, subject to credit approval and credit limit, and requires you to select Citizens One Apple iPhone Payments or Apple Card Monthly Installments (ACMI) as your payment type at checkout at Apple. You’ll need to select AT&T, Boost Mobile, T‑Mobile, or Verizon as your carrier when you checkout. An iPhone purchased with ACMI is always unlocked, so you can switch carriers at any time, subject to your carrier’s terms. Taxes and shipping on items purchased using ACMI are subject to your card’s variable APR, not the ACMI 0% APR. ACMI is not available for purchases made online at special storefronts. The last month’s payment for each product will be the product’s purchase price, less all other payments at the monthly payment amount. ACMI financing is subject to change at any time for any reason, including but not limited to, installment term lengths and eligible products. See theApple Card Customer Agreement(Opens in a new window)for more information about ACMI. Additional Citizens One Apple iPhone Payments terms arehere(Opens in a new window). ◊ Apple Card Monthly Installments (ACMI) is a 0% APR payment option that is only available if you select it at checkout in the U.S. for eligible products purchased at Apple Store locations,apple.com(Opens in a new window), the Apple Store app, or by calling 1-800-MY-APPLE, and is subject to credit approval and credit limit. Seesupport.apple.com/102730(Opens in a new window)for more information about eligible products. Existing customers: See your Customer Agreement for your variable APR. As of January 1, 2025, the variable APR on new Apple Card accounts ranges from 18.24% to 28.49%. You must elect to use ACMI at checkout. If you buy an ACMI-eligible product with a one-time payment on Apple Card at checkout, that purchase is subject to your Apple Card’s variable APR, not the ACMI 0% APR. Taxes and shipping on items purchased using ACMI are subject to your Apple Card’s variable APR, not the ACMI 0% APR. In order to buy an iPhone with ACMI, you must select one of the following carriers: AT&T, Boost Mobile, T-Mobile, or Verizon. An iPhone purchased with ACMI is always unlocked, so you can switch carriers at any time, subject to your carrier’s terms. ACMI is not available for purchases made online at the following special stores: Apple Employee Purchase Plan; participating corporate Employee Purchase Programs; Apple at Work for small businesses; Government and Veterans and Military Purchase Programs; or on refurbished devices. The last month’s payment for each product will be the product’s purchase price, less all other payments at the monthly payment amount. ACMI is subject to change at any time for any reason, including but not limited to installment term lengths and eligible products. Seethe Apple Card Customer Agreement(Opens in a new window)for more information about ACMI. To access and use all Apple Card features and products available only to Apple Card users, you must add Apple Card to Wallet on an iPhone or iPad that supports and has the latest version of iOS or iPadOS. Apple Card is subject to credit approval, available only for qualifying applicants in the United States, and issued by Goldman Sachs Bank USA, Salt Lake City Branch.Apple Payments Services LLC, a subsidiary of Apple Inc., is a service provider of Goldman Sachs Bank USA for Apple Card and Savings accounts. Neither Apple Inc. nor Apple Payments Services LLC is a bank.If you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about Apple Card. To access and use all Apple Card features and products available only to Apple Card users, you must add Apple Card to Wallet on an iPhone or iPad that supports and has the latest version of iOS or iPadOS. Apple Card is subject to credit approval, available only for qualifying applicants in the United States, and issued by Goldman Sachs Bank USA, Salt Lake City Branch. Apple Payments Services LLC, a subsidiary of Apple Inc., is a service provider of Goldman Sachs Bank USA for Apple Card and Savings accounts. Neither Apple Inc. nor Apple Payments Services LLC is a bank. If you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about Apple Card. †Monthly pricing is available when you select Apple Card Monthly Installments (ACMI) as payment type at checkout at Apple, and is subject to credit approval and credit limit. Financing terms vary by product. Taxes and shipping are not included in ACMI and are subject to your card’s variable APR. See theApple Card Customer Agreement(Opens in a new window)for more information. ACMI is not available for purchases made online at special storefronts. The last month’s payment for each product will be the product’s purchase price, less all other payments at the monthly payment amount. ACMI financing is subject to change at any time for any reason, including but not limited to, installment term lengths and eligible products. Seesupport.apple.com/kb/HT211204(Opens in a new window)for information about upcoming changes to ACMI financing. 1. Special pricing available to qualified customers. To learn more about how to start qualifying toward special pricing, talk to an Apple Specialist in a store or give us a call at 1‑800‑MY‑APPLE. 2. $9 two-hour delivery on eligible Apple products in most metros. Offer is not available on customized Mac, engraved products, and for certain order types including orders paid for with financing or by bank transfer. Delivery times vary according to your selected delivery address, availability of your items, and the time of day you place your order. Find a store to view local store hours or see checkout for estimated delivery. A signature is required for delivery. Drivers may ask for verbal confirmation of receipt from a safe distance to satisfy the signature requirement. Seehttps://www.apple.com/shop/shipping-pickup/for more information. 3. Trade-in values will vary based on the condition, year, and configuration of your eligible trade-in device. Not all devices are eligible for credit. You must be at least the age of majority to be eligible to trade in for credit or for an Apple Gift Card. Trade-in value may be applied toward qualifying new device purchase, or added to an Apple Gift Card. Actual value awarded is based on receipt of a qualifying device matching the description provided when estimate was made. Sales tax may be assessed on full value of a new device purchase. In-store trade-in requires presentation of a valid photo ID (local law may require saving this information). Offer may not be available in all stores, and may vary between in-store and online trade-in. Some stores may have additional requirements. Apple or its trade-in partners reserve the right to refuse, cancel, or limit quantity of any trade-in transaction for any reason. More details are available from Apple’s trade-in partner for trade-in and recycling of eligible devices. Restrictions and limitations may apply. 4.AT&T iPhone 16 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of AT&T trade-in credit applied over 36 months with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, or iPhone 16, and trade-in of eligible smartphone. Receive credit with purchase of an iPhone 16 Pro or iPhone 16 Pro Max of either $1000, $830, or $350 (based upon the model and condition of your trade-in smartphone). Receive credit with purchase of an iPhone 16 of either $800 or $350 (based upon the model and condition of your trade-in smartphone). Max bill credits will not exceed the cost of the device. Requires upgrade of an existing line or activation of a new line and purchase of a new iPhone 16 Pro, iPhone 16 Pro Max, or iPhone 16, on qualifying 36 month 0% APR installment plan, subject to carrier credit qualification. Customers purchasing this offer through Apple cannot add the Next Up Anytime option. $0 down for well qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible AT&T unlimited plan. AT&T may temporarily slow data speeds if the network is busy. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Activation/Upgrade Fee: $35. Trade in device may not be on existing installment plan. Bill credits are applied as a monthly credit over the 36 month installment plan. Credits start within 3 bills. Will receive catchup credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited time offer; subject to change. Limits: one trade-in per qualifying purchase and one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Price for iPhone 16 and iPhone 16 Plus includes $30 AT&T connectivity discount. Activation required.AT&T iPhone 16e Special Deal:Buy an iPhone 16e 128 GB and get $383.36 in bill credits applied over 36 months. Buy an iPhone 16e 256 GB and get $303.36 in bill credits applied over 36 months. Buy an iPhone 16e 512 GB and get $323.36 in bill credits applied over 36 months. Requires upgrade of an existing line (or activation of a new line) and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. $0 down for well-qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible AT&T unlimited plan. AT&T may temporarily slow data speeds if the network is busy. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Activation/Upgrade Fee: $35. Bill credits are applied as a monthly credit over the 36-month installment plan. Credits start within 3 bills. Will receive catch-up credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Activation required.AT&T iPhone 15 Special Deal:Buy an iPhone 15 128 GB and get $513.36 in bill credits applied over 36 months. Buy an iPhone 15 256 GB and get $433.36 in bill credits applied over 36 months. Buy an iPhone 15 512 GB and get $453.36 in bill credits applied over 36 months. Requires upgrade of an existing line (or activation of a new line) and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. $0 down for well-qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible AT&T unlimited plan. AT&T may temporarily slow data speeds if the network is busy. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Activation/Upgrade Fee: $35. Bill credits are applied as a monthly credit over the 36-month installment plan. Credits start within 3 bills. Will receive catch-up credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Activation required.Boost Mobile iPhone 16 Special Deal:Buy an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus and get $1000 in bill credits (not to exceed the cost of the iPhone) applied over 36 months. No trade-in required. If you are trading in a device with this deal, trade-in value will be applied as additional bill credits over 36 months. Monthly price (if shown) reflects net monthly payment, after application of $1000 in bill credit (not to exceed the cost of the iPhone purchased) and trade-in credit (if applicable) applied over 36 months respectively. Requires activation of a new line, Boost Mobile Infinite Access plan and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. After making 12 installment payments, you may upgrade to a new iPhone and get up to $1000 in bill credits (not to exceed the cost of the iPhone) applied over 36 months for the new iPhone on the Infinite Access plan and purchase on new qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. Tax on full retail price due at sale. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Bill credits are applied as a monthly credit over the 36-month installment plan. Trade-in credits start within 3 bills. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combined with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Price for iPhone 16 and iPhone 16 Plus includes $30 Boost Mobile connectivity discount. Activation required.T-Mobile iPhone 16 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T-Mobile trade-in credit applied over 24 months with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus and trade-in of eligible smartphone.Existing customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer.Add-a-Line customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account.New customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due.T-Mobile iPhone 16e Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T-Mobile trade-in credit applied over 24 months with purchase of an iPhone 16e and trade-in of eligible smartphone.Existing customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer.Add-a-Line customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account.New customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due.T-Mobile iPhone 15 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T-Mobile trade-in credit applied over 24 months with purchase of an iPhone 15 or iPhone 15 Plus and trade-in of eligible smartphone.Existing customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer.Add-a-Line customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account.New customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus(based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due.Verizon iPhone 16 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of Verizon trade-in credit applied over 36 months with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus.Existing customers: Customers on an Unlimited Ultimate plan receive: $1000 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro or iPhone 16 Pro Max; $930 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Plus; or $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16. Customers on an Unlimited Plus plan receive $415 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Must be an existing Verizon customer.New or Add-a-Line customers: Customers on an Unlimited Ultimate plan, Unlimited Plus plan, or Unlimited Welcome plan receive: $1000 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro or iPhone 16 Pro Max; $930 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Plus; or $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16. Must be a new Verizon customer or adding a new line to an existing Verizon account.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) Verizon monthly bill credits applied over 36 months. Customer must remain in the Verizon Device Payment Program for 36 months to receive the full benefit of the Verizon bill credits. Bill credits may take 1-2 bill cycles to appear. If it takes two cycles for bill credits to appear, you'll see the credit for the first cycle on your second bill in addition to that month's credit. Requires purchase and activation of a new iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus with the Verizon Device Payment Program at 0% APR for 36 months, subject to carrier credit qualification, and iPhone availability and limits. Taxes and shipping not included in monthly price. Sales tax may be assessed on full value of new iPhone. Requires eligible unlimited service plan. Requires trade-in of eligible device in eligible condition. Must be at least 18 to trade-in. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). In-store promotion availability subject to local law; speak to a Specialist to learn more. Limited-time offer; subject to change. Additional terms from Apple, Verizon, and Apple's trade-in partners may apply. Price for iPhone 16 and iPhone 16 Plus includes $30 Verizon connectivity discount. Activation required.Verizon iPhone 16e Special Deal:Monthly price (if shown) reflects net monthly payment, after application of Verizon trade-in credit applied over 36 months with purchase of an iPhone 16e.Existing customers: Customers on an Unlimited Ultimate plan receive $600 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16e. Must be an existing Verizon customer.New or Add-a-Line customers: Customers on an Unlimited Ultimate plan, Unlimited Plus plan, or Unlimited Welcome plan receive $600 credit (based upon the model and condition of your trade-in smartphone) with purchase of a iPhone 16e. Must be a new Verizon customer or adding a new line to an existing Verizon account.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) Verizon monthly bill credits applied over 36 months. Customer must remain in the Verizon Device Payment Program for 36 months to receive the full benefit of the Verizon bill credits. Bill credits may take 1-2 bill cycles to appear. If it takes two cycles for bill credits to appear, you'll see the credit for the first cycle on your second bill in addition to that month's credit. Requires purchase and activation of a new iPhone 16e with the Verizon Device Payment Program at 0% APR for 36 months, subject to carrier credit qualification, and iPhone availability and limits. Taxes and shipping not included in monthly price. Sales tax may be assessed on full value of new iPhone. Requires eligible unlimited service plan. Requires trade-in of eligible device in eligible condition. Must be at least 18 to trade-in. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). In-store promotion availability subject to local law; speak to a Specialist to learn more. Limited-time offer; subject to change. Additional terms from Apple, Verizon, and Apple's trade-in partners may apply. Activation required. AT&T iPhone 16e Special Deal:Buy an iPhone 16e 128 GB and get $383.36 in bill credits applied over 36 months. Buy an iPhone 16e 256 GB and get $303.36 in bill credits applied over 36 months. Buy an iPhone 16e 512 GB and get $323.36 in bill credits applied over 36 months. Requires upgrade of an existing line (or activation of a new line) and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. $0 down for well-qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible AT&T unlimited plan. AT&T may temporarily slow data speeds if the network is busy. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Activation/Upgrade Fee: $35. Bill credits are applied as a monthly credit over the 36-month installment plan. Credits start within 3 bills. Will receive catch-up credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Activation required. AT&T iPhone 15 Special Deal:Buy an iPhone 15 128 GB and get $513.36 in bill credits applied over 36 months. Buy an iPhone 15 256 GB and get $433.36 in bill credits applied over 36 months. Buy an iPhone 15 512 GB and get $453.36 in bill credits applied over 36 months. Requires upgrade of an existing line (or activation of a new line) and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. $0 down for well-qualified customers only, or down payment may be required and depends on a variety of factors. Tax on full retail price due at sale. Requires activation on eligible AT&T unlimited plan. AT&T may temporarily slow data speeds if the network is busy. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Activation/Upgrade Fee: $35. Bill credits are applied as a monthly credit over the 36-month installment plan. Credits start within 3 bills. Will receive catch-up credits once credits start. Wireless line must be on an installment agreement, active, and in good standing for 30 days to qualify. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combinable with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Activation required. Boost Mobile iPhone 16 Special Deal:Buy an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus and get $1000 in bill credits (not to exceed the cost of the iPhone) applied over 36 months. No trade-in required. If you are trading in a device with this deal, trade-in value will be applied as additional bill credits over 36 months. Monthly price (if shown) reflects net monthly payment, after application of $1000 in bill credit (not to exceed the cost of the iPhone purchased) and trade-in credit (if applicable) applied over 36 months respectively. Requires activation of a new line, Boost Mobile Infinite Access plan and purchase on qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. After making 12 installment payments, you may upgrade to a new iPhone and get up to $1000 in bill credits (not to exceed the cost of the iPhone) applied over 36 months for the new iPhone on the Infinite Access plan and purchase on new qualifying 36-month 0% APR installment plan, subject to carrier credit qualification. Tax on full retail price due at sale. If you cancel eligible wireless service, credits will stop and you will owe the remaining device balance. Bill credits are applied as a monthly credit over the 36-month installment plan. Trade-in credits start within 3 bills. Installment agreement starts when device is shipped. To get all credits, device must remain on agreement for entire term and you must keep eligible service on device for entire installment term. Limited-time offer; subject to change. Limits: one credit per line. May not be combined with other offers, discounts, or credits. Purchase, financing, other limits, and restrictions apply. Price for iPhone 16 and iPhone 16 Plus includes $30 Boost Mobile connectivity discount. Activation required. T-Mobile iPhone 16 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T-Mobile trade-in credit applied over 24 months with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus and trade-in of eligible smartphone.Existing customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer.Add-a-Line customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account.New customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. Existing customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer. Add-a-Line customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account. New customers: Receive credit with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. T-Mobile iPhone 16e Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T-Mobile trade-in credit applied over 24 months with purchase of an iPhone 16e and trade-in of eligible smartphone.Existing customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer.Add-a-Line customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account.New customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. Existing customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer. Add-a-Line customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account. New customers: Receive credit with purchase of an iPhone 16e (based upon the model and condition of your trade-in smartphone) of $899, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. T-Mobile iPhone 15 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of T-Mobile trade-in credit applied over 24 months with purchase of an iPhone 15 or iPhone 15 Plus and trade-in of eligible smartphone.Existing customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer.Add-a-Line customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account.New customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus(based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. Existing customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus or Magenta MAX plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus or Magenta MAX 55, Military, or First Responder plan; or $500 or $250 for customers on a Go5G, Magenta, or Essentials plan. Must be an existing T-Mobile customer. Add-a-Line customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus (based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials, Simple Choice, TMO ONE/Plus, Magenta/MAX or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, TMO ONE/Plus, Magenta/MAX & Go5G 55, Military, or First Responder plan. Must be a T-Mobile customer adding a new line to an existing T-Mobile account. New customers: Receive credit with purchase of an iPhone 15 or iPhone 15 Plus(based upon the model and condition of your trade-in smartphone) of $1000, $800, or $400 for customers on a Go5G Next plan (excluding 55, Military, First Responder plans); or $800 or $400 for customers on a Go5G Plus plan (excluding 55, Military, First Responder plans); or $800, $600, or $300 for customers on a Go5G Next 55, Military, or First Responder plan; or $600 or $300 for customers on a Go5G Plus 55, Military, or First Responder plan; or $800 or $400 for customers on an Essentials or Go5G plan (excluding 55, Military, First Responder plans); or $600 or $300 for customers on an Essentials 55 Choice, or Go5G 55, Military, or First Responder plan. Must be a new T-Mobile customer. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) T-Mobile monthly bill credits applied over 24 months. Allow 2 bill cycles from valid submission and validation of trade-in. Tax on pre-credit price due at sale. Limited-time offer; subject to change. Qualifying credit, data plan, and trade-in in good condition required. Max 4 promotional offers on any iPhone per account. May not be combinable with some offers or discounts. Activation required.Contact T-Mobile before cancelling service to continue remaining bill credits on current device, or credits stop & balance on required finance agreement is due. Verizon iPhone 16 Special Deal:Monthly price (if shown) reflects net monthly payment, after application of Verizon trade-in credit applied over 36 months with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus.Existing customers: Customers on an Unlimited Ultimate plan receive: $1000 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro or iPhone 16 Pro Max; $930 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Plus; or $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16. Customers on an Unlimited Plus plan receive $415 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Must be an existing Verizon customer.New or Add-a-Line customers: Customers on an Unlimited Ultimate plan, Unlimited Plus plan, or Unlimited Welcome plan receive: $1000 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro or iPhone 16 Pro Max; $930 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Plus; or $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16. Must be a new Verizon customer or adding a new line to an existing Verizon account.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) Verizon monthly bill credits applied over 36 months. Customer must remain in the Verizon Device Payment Program for 36 months to receive the full benefit of the Verizon bill credits. Bill credits may take 1-2 bill cycles to appear. If it takes two cycles for bill credits to appear, you'll see the credit for the first cycle on your second bill in addition to that month's credit. Requires purchase and activation of a new iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus with the Verizon Device Payment Program at 0% APR for 36 months, subject to carrier credit qualification, and iPhone availability and limits. Taxes and shipping not included in monthly price. Sales tax may be assessed on full value of new iPhone. Requires eligible unlimited service plan. Requires trade-in of eligible device in eligible condition. Must be at least 18 to trade-in. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). In-store promotion availability subject to local law; speak to a Specialist to learn more. Limited-time offer; subject to change. Additional terms from Apple, Verizon, and Apple's trade-in partners may apply. Price for iPhone 16 and iPhone 16 Plus includes $30 Verizon connectivity discount. Activation required. Existing customers: Customers on an Unlimited Ultimate plan receive: $1000 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro or iPhone 16 Pro Max; $930 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Plus; or $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16. Customers on an Unlimited Plus plan receive $415 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus. Must be an existing Verizon customer. New or Add-a-Line customers: Customers on an Unlimited Ultimate plan, Unlimited Plus plan, or Unlimited Welcome plan receive: $1000 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Pro or iPhone 16 Pro Max; $930 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16 Plus; or $830 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16. Must be a new Verizon customer or adding a new line to an existing Verizon account. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) Verizon monthly bill credits applied over 36 months. Customer must remain in the Verizon Device Payment Program for 36 months to receive the full benefit of the Verizon bill credits. Bill credits may take 1-2 bill cycles to appear. If it takes two cycles for bill credits to appear, you'll see the credit for the first cycle on your second bill in addition to that month's credit. Requires purchase and activation of a new iPhone 16 Pro, iPhone 16 Pro Max, iPhone 16, or iPhone 16 Plus with the Verizon Device Payment Program at 0% APR for 36 months, subject to carrier credit qualification, and iPhone availability and limits. Taxes and shipping not included in monthly price. Sales tax may be assessed on full value of new iPhone. Requires eligible unlimited service plan. Requires trade-in of eligible device in eligible condition. Must be at least 18 to trade-in. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). In-store promotion availability subject to local law; speak to a Specialist to learn more. Limited-time offer; subject to change. Additional terms from Apple, Verizon, and Apple's trade-in partners may apply. Price for iPhone 16 and iPhone 16 Plus includes $30 Verizon connectivity discount. Activation required. Verizon iPhone 16e Special Deal:Monthly price (if shown) reflects net monthly payment, after application of Verizon trade-in credit applied over 36 months with purchase of an iPhone 16e.Existing customers: Customers on an Unlimited Ultimate plan receive $600 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16e. Must be an existing Verizon customer.New or Add-a-Line customers: Customers on an Unlimited Ultimate plan, Unlimited Plus plan, or Unlimited Welcome plan receive $600 credit (based upon the model and condition of your trade-in smartphone) with purchase of a iPhone 16e. Must be a new Verizon customer or adding a new line to an existing Verizon account.Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) Verizon monthly bill credits applied over 36 months. Customer must remain in the Verizon Device Payment Program for 36 months to receive the full benefit of the Verizon bill credits. Bill credits may take 1-2 bill cycles to appear. If it takes two cycles for bill credits to appear, you'll see the credit for the first cycle on your second bill in addition to that month's credit. Requires purchase and activation of a new iPhone 16e with the Verizon Device Payment Program at 0% APR for 36 months, subject to carrier credit qualification, and iPhone availability and limits. Taxes and shipping not included in monthly price. Sales tax may be assessed on full value of new iPhone. Requires eligible unlimited service plan. Requires trade-in of eligible device in eligible condition. Must be at least 18 to trade-in. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). In-store promotion availability subject to local law; speak to a Specialist to learn more. Limited-time offer; subject to change. Additional terms from Apple, Verizon, and Apple's trade-in partners may apply. Activation required. Existing customers: Customers on an Unlimited Ultimate plan receive $600 credit (based upon the model and condition of your trade-in smartphone) with purchase of an iPhone 16e. Must be an existing Verizon customer. New or Add-a-Line customers: Customers on an Unlimited Ultimate plan, Unlimited Plus plan, or Unlimited Welcome plan receive $600 credit (based upon the model and condition of your trade-in smartphone) with purchase of a iPhone 16e. Must be a new Verizon customer or adding a new line to an existing Verizon account. Max bill credits will not exceed the cost of the device. Credit comprised of (i) Apple instant trade-in credit at checkout and (ii) Verizon monthly bill credits applied over 36 months. Customer must remain in the Verizon Device Payment Program for 36 months to receive the full benefit of the Verizon bill credits. Bill credits may take 1-2 bill cycles to appear. If it takes two cycles for bill credits to appear, you'll see the credit for the first cycle on your second bill in addition to that month's credit. Requires purchase and activation of a new iPhone 16e with the Verizon Device Payment Program at 0% APR for 36 months, subject to carrier credit qualification, and iPhone availability and limits. Taxes and shipping not included in monthly price. Sales tax may be assessed on full value of new iPhone. Requires eligible unlimited service plan. Requires trade-in of eligible device in eligible condition. Must be at least 18 to trade-in. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). In-store promotion availability subject to local law; speak to a Specialist to learn more. Limited-time offer; subject to change. Additional terms from Apple, Verizon, and Apple's trade-in partners may apply. Activation required. °° Get extra trade-in credit when you trade in an eligible Mac and purchase a new eligible Apple device through April 2, 2025. Additional terms from Apple or Apple’s trade-in partners may apply. ⁺ New subscribers only. $10.99/month after trial. Offer is available for new Apple Music subscribers with a new eligible device for a limited time only. Offer redemption for eligible audio devices requires connecting or pairing to an Apple device running the latest iOS or iPadOS. Offer redemption for Apple Watch requires connecting or pairing to an iPhone running the latest iOS. Offer good for three months after eligible device activation. Only one offer per Apple Account, regardless of the number of eligible devices you purchase. Plan automatically renews until cancelled. Restrictions and otherterms(Opens in a new window)apply. ⁺⁺ Apple TV+ offer available to new and qualified returning subscribers only. $9.99/month after free trial. Only one offer per Apple Account and only one offer per family if you’re part of a Family Sharing group, regardless of the number of devices that you or your family purchase. This offer is not available if you or your family have previously accepted an Apple TV+ 3 months free or 1 year free offer. Offer good for 3 months after eligible device is activated. Plan automatically renews until cancelled. Restrictions and othertermsapply. Apple Pay is a service provided by Apple Payments Services LLC, a subsidiary of Apple Inc. Neither Apple Inc. nor Apple Payments Services LLC is a bank. Any card used in Apple Pay is offered by the card issuer. We approximate your location from your internet IP address by matching it to a geographic region or from the location entered during your previous visit to Apple. More ways to shop:Find an Apple Storeorother retailernear you. Orcall1‑800‑MY‑APPLE."}]