[{"id": 1, "link": "https://zeenews.india.com/mobility/people-sabotaging-tesla-cars-may-go-to-jail-for-up-to-20-years-donald-trump-2875073.html", "source": "Zee News", "title": "People Sabotaging Tesla Cars May Go To Jail For Up To 20 Years: Donald Trump", "summary": "Washington DC: US President Donald Trump said on Friday that people who are caught sabotaging Tesla cars may stand a chance of going to jail...", "content": "US President Donald Trump said on Friday that people who are caught sabotaging Tesla cars may stand a chance of going to jail for up to twenty years. Washington DC:US President Donald Trump said on Friday that people who are caught sabotaging Tesla cars may stand a chance of going to jail for up to twenty years. He made the announcement in a post on Truth Social. Trump wrote, \"People that get caught sabotaging Teslas will stand a very good chance of going to jail for up to twenty years, and that includes the funders. WE ARE LOOKING FOR YOU!!!\"The statement by Trump comes after US Attorney General Pam Bondi has called the recent violent attacks on Tesla property \"nothing short of domestic terrorism\" and vowed to investigations that impose severe consequences on those involved in these attacks, including those operating behind the scenes to coordinate and fund these crimes.In a statement, Bondi stated, \"The swarm of violent attacks on Tesla property is nothing short of domestic terrorism. The Department of Justice has already charged several perpetrators with that in mind, including in cases that involve charges with five-year mandatory minimum sentences.\"\"We will continue investigations that impose severe consequences on those involved in these attacks, including those operating behind the scenes to coordinate and fund these crimes,\" she added.Bondi's statement came after five Tesla vehicles were damaged when a fire erupted at a Tesla Collision Center in Las Vegas on Tuesday morning. The incident was the latest of such incidents aimed at the electric vehicle company, according to the Las Vegas Metropolitan Police Department, ABC News reported.Since Tesla CEO Elon Musk started serving as head of the Department of Government Efficiency (DOGE), Tesla vehicles, dealerships and charging stations have been vandalised and faced protests in recent weeks.Meanwhile, the US Department of Defence is set to brief Elon Musk on plans for a potential war with China, according to a report by The New York Times. The publication said that the access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest. It said that the billionaire chief executive of both SpaceX and Tesla is a leading supplier to the Pentagon and has extensive financial interests in China.Musk was also the largest financial supporter of the US President during the presidential campaign. The statement by Trump comes after US Attorney General Pam Bondi has called the recent violent attacks on Tesla property \"nothing short of domestic terrorism\" and vowed to investigations that impose severe consequences on those involved in these attacks, including those operating behind the scenes to coordinate and fund these crimes.In a statement, Bondi stated, \"The swarm of violent attacks on Tesla property is nothing short of domestic terrorism. The Department of Justice has already charged several perpetrators with that in mind, including in cases that involve charges with five-year mandatory minimum sentences.\"\"We will continue investigations that impose severe consequences on those involved in these attacks, including those operating behind the scenes to coordinate and fund these crimes,\" she added.Bondi's statement came after five Tesla vehicles were damaged when a fire erupted at a Tesla Collision Center in Las Vegas on Tuesday morning. The incident was the latest of such incidents aimed at the electric vehicle company, according to the Las Vegas Metropolitan Police Department, ABC News reported.Since Tesla CEO Elon Musk started serving as head of the Department of Government Efficiency (DOGE), Tesla vehicles, dealerships and charging stations have been vandalised and faced protests in recent weeks.Meanwhile, the US Department of Defence is set to brief Elon Musk on plans for a potential war with China, according to a report by The New York Times. The publication said that the access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest. It said that the billionaire chief executive of both SpaceX and Tesla is a leading supplier to the Pentagon and has extensive financial interests in China.Musk was also the largest financial supporter of the US President during the presidential campaign. In a statement, Bondi stated, \"The swarm of violent attacks on Tesla property is nothing short of domestic terrorism. The Department of Justice has already charged several perpetrators with that in mind, including in cases that involve charges with five-year mandatory minimum sentences.\"\"We will continue investigations that impose severe consequences on those involved in these attacks, including those operating behind the scenes to coordinate and fund these crimes,\" she added.Bondi's statement came after five Tesla vehicles were damaged when a fire erupted at a Tesla Collision Center in Las Vegas on Tuesday morning. The incident was the latest of such incidents aimed at the electric vehicle company, according to the Las Vegas Metropolitan Police Department, ABC News reported.Since Tesla CEO Elon Musk started serving as head of the Department of Government Efficiency (DOGE), Tesla vehicles, dealerships and charging stations have been vandalised and faced protests in recent weeks.Meanwhile, the US Department of Defence is set to brief Elon Musk on plans for a potential war with China, according to a report by The New York Times. The publication said that the access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest. It said that the billionaire chief executive of both SpaceX and Tesla is a leading supplier to the Pentagon and has extensive financial interests in China.Musk was also the largest financial supporter of the US President during the presidential campaign. \"We will continue investigations that impose severe consequences on those involved in these attacks, including those operating behind the scenes to coordinate and fund these crimes,\" she added.Bondi's statement came after five Tesla vehicles were damaged when a fire erupted at a Tesla Collision Center in Las Vegas on Tuesday morning. The incident was the latest of such incidents aimed at the electric vehicle company, according to the Las Vegas Metropolitan Police Department, ABC News reported.Since Tesla CEO Elon Musk started serving as head of the Department of Government Efficiency (DOGE), Tesla vehicles, dealerships and charging stations have been vandalised and faced protests in recent weeks.Meanwhile, the US Department of Defence is set to brief Elon Musk on plans for a potential war with China, according to a report by The New York Times. The publication said that the access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest. It said that the billionaire chief executive of both SpaceX and Tesla is a leading supplier to the Pentagon and has extensive financial interests in China.Musk was also the largest financial supporter of the US President during the presidential campaign. Bondi's statement came after five Tesla vehicles were damaged when a fire erupted at a Tesla Collision Center in Las Vegas on Tuesday morning. The incident was the latest of such incidents aimed at the electric vehicle company, according to the Las Vegas Metropolitan Police Department, ABC News reported.Since Tesla CEO Elon Musk started serving as head of the Department of Government Efficiency (DOGE), Tesla vehicles, dealerships and charging stations have been vandalised and faced protests in recent weeks.Meanwhile, the US Department of Defence is set to brief Elon Musk on plans for a potential war with China, according to a report by The New York Times. The publication said that the access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest. It said that the billionaire chief executive of both SpaceX and Tesla is a leading supplier to the Pentagon and has extensive financial interests in China.Musk was also the largest financial supporter of the US President during the presidential campaign. Since Tesla CEO Elon Musk started serving as head of the Department of Government Efficiency (DOGE), Tesla vehicles, dealerships and charging stations have been vandalised and faced protests in recent weeks.Meanwhile, the US Department of Defence is set to brief Elon Musk on plans for a potential war with China, according to a report by The New York Times. The publication said that the access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest. It said that the billionaire chief executive of both SpaceX and Tesla is a leading supplier to the Pentagon and has extensive financial interests in China.Musk was also the largest financial supporter of the US President during the presidential campaign. Meanwhile, the US Department of Defence is set to brief Elon Musk on plans for a potential war with China, according to a report by The New York Times. The publication said that the access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest. It said that the billionaire chief executive of both SpaceX and Tesla is a leading supplier to the Pentagon and has extensive financial interests in China.Musk was also the largest financial supporter of the US President during the presidential campaign. Musk was also the largest financial supporter of the US President during the presidential campaign. Stay informed on all thelatest news, real-timebreaking newsupdates, and follow all the important headlines inindia newsandworld Newson Zee News."}, {"id": 2, "link": "https://www.cnbc.com/quotes/TSLA", "source": "CNBC", "title": "Check out Tesla's stock price (TSLA) in real time", "summary": "Get Tesla Inc (TSLA:NASDAQ) real-time stock quotes, news, price and financial information from CNBC.", "content": "Credit Monitoring Personal Finance Help for Low Credit Scores Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best Credit Unions Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance AllCredit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services AllPersonal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief AllSmall Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business Best Tax Software Best Tax Software for Small Businesses Tax Payment Plans AllHelp for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. ©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by"}, {"id": 3, "link": "https://www.newsx.com/tag/tesla-takedown-movement/", "source": "Newsx", "title": "Tesla Takedown Movement", "summary": "Today Tesla Takedown Movement News, Latest Tesla Takedown Movement News, Breaking Tesla Takedown Movement News in English, Latest Tesla Takedown Movement...", "content": "Elon Musk's role in cutting federal government staffing and budgets through his leadership of the Department of Government Efficiency (DOGE) has sparked widespread backlash. As a result, nearly 90 Tesla showrooms across the United States became the site of demonstrations on Saturday, marking the fifth consecutive week of the \"Tesla... © Copyright ITV Network Ltd 2025. All rights reserved."}, {"id": 4, "link": "https://www.newsx.com/tag/tesla-protests/", "source": "Newsx", "title": "tesla protests", "summary": "Today tesla protests News, Latest tesla protests News, Breaking tesla protests News in English, Latest tesla protests News Headlines - Newsx.", "content": "Elon Musk's role in cutting federal government staffing and budgets through his leadership of the Department of Government Efficiency (DOGE) has sparked widespread backlash. As a result, nearly 90 Tesla showrooms across the United States became the site of demonstrations on Saturday, marking the fifth consecutive week of the \"Tesla... © Copyright ITV Network Ltd 2025. All rights reserved."}, {"id": 5, "link": "https://telanganatoday.com/tesla-dealerships-under-attack-in-us-as-musk-takes-up-vital-role-under-trump-administration", "source": "Telangana Today", "title": "Tesla dealerships under attack in US as Musk takes up vital role under Trump administration", "summary": "Attacks on property carrying the logo of Elon Musk's electric-car company are cropping up across the US and overseas.", "content": "Attacks on property carrying the logo of Elon Musk's electric-car company are cropping up across the US and overseas Seattle:Cybertrucks set ablaze. Bullets and Molotov cocktails aimed at Tesla showrooms. Attacks on property carrying the logo of Elon Musk’s electric-car company are cropping up across the US and overseas. While no injuries have been reported, Tesla showrooms, vehicle lots, charging stations and privately owned cars have been targeted.There has been a clear uptick since President Donald Trump took office and empowered Musk to oversee a new Department of Government Efficiency that is slashing government spending. Experts on domestic extremism say it’s impossible to know yet if the spate of incidents will balloon into a long-term pattern.In Trump’s first term, his properties in New York City, Washington and elsewhere became a natural place for protest. In the early days of his second term, Tesla is filling that role. “Tesla is an easy target,” said Randy Blazak, a sociologist who studies political violence. “They’re rolling down our streets. They have dealerships in our neighborhoods.”Musk critics have organised dozens of peaceful demonstrations at Tesla dealerships and factories across North America and Europe. Some Tesla owners, including a US senator who feuded with Musk, have vowed to sell their vehicles. But the attacks are keeping law enforcement busy.Prosecutors in Colorado charged a woman last month in connection with a string of attacks on Tesla dealerships, including Molotov cocktails thrown at vehicles and the words “Nazi cars” spray-painted on a building.And federal agents in South Carolina last week arrested a man they say set fire to Tesla charging stations near Charleston. An agent from the Bureau of Alcohol, Tobacco, Firearms and Explosives wrote in an affidavit that authorities found writings critical of the government and DOGE in his bedroom and wallet. “The statement made mention of sending a message based on these beliefs,” the agent wrote.A number of the most prominent incidents have been reported in left-leaning cities in the Pacific Northwest, like Portland, Oregon, and Seattle, where anti-Trump and anti-Musk sentiment runs high.An Oregon man is facing charges after allegedly throwing several Molotov cocktails at a Tesla store in Salem, then returning another day and shooting out windows. In the Portland suburb of Tigard, more than a dozen bullets were fired at a Tesla showroom last week, damaging vehicles and windows, the second time in a week that the store was targeted.Four Cybertrucks were set on fire in a Tesla lot in Seattle earlier this month. On Friday, witnesses reported a man poured gasoline on an unoccupied Tesla Model S and started a fire on a Seattle street.In Las Vegas, several Tesla vehicles were set ablaze early Tuesday outside a Tesla service center where the word “resist” was also painted in red across the building’s front doors. Authorities said at least one person threw Molotov cocktails — crude bombs filled with gasoline or another flammable liquid — and fired several rounds from a weapon into the vehicles. AP Seattle:Cybertrucks set ablaze. Bullets and Molotov cocktails aimed at Tesla showrooms. Attacks on property carrying the logo of Elon Musk’s electric-car company are cropping up across the US and overseas. While no injuries have been reported, Tesla showrooms, vehicle lots, charging stations and privately owned cars have been targeted. There has been a clear uptick since President Donald Trump took office and empowered Musk to oversee a new Department of Government Efficiency that is slashing government spending. Experts on domestic extremism say it’s impossible to know yet if the spate of incidents will balloon into a long-term pattern. In Trump’s first term, his properties in New York City, Washington and elsewhere became a natural place for protest. In the early days of his second term, Tesla is filling that role. “Tesla is an easy target,” said Randy Blazak, a sociologist who studies political violence. “They’re rolling down our streets. They have dealerships in our neighborhoods.” Musk critics have organised dozens of peaceful demonstrations at Tesla dealerships and factories across North America and Europe. Some Tesla owners, including a US senator who feuded with Musk, have vowed to sell their vehicles. But the attacks are keeping law enforcement busy. Prosecutors in Colorado charged a woman last month in connection with a string of attacks on Tesla dealerships, including Molotov cocktails thrown at vehicles and the words “Nazi cars” spray-painted on a building. And federal agents in South Carolina last week arrested a man they say set fire to Tesla charging stations near Charleston. An agent from the Bureau of Alcohol, Tobacco, Firearms and Explosives wrote in an affidavit that authorities found writings critical of the government and DOGE in his bedroom and wallet. “The statement made mention of sending a message based on these beliefs,” the agent wrote. A number of the most prominent incidents have been reported in left-leaning cities in the Pacific Northwest, like Portland, Oregon, and Seattle, where anti-Trump and anti-Musk sentiment runs high. An Oregon man is facing charges after allegedly throwing several Molotov cocktails at a Tesla store in Salem, then returning another day and shooting out windows. In the Portland suburb of Tigard, more than a dozen bullets were fired at a Tesla showroom last week, damaging vehicles and windows, the second time in a week that the store was targeted. Four Cybertrucks were set on fire in a Tesla lot in Seattle earlier this month. On Friday, witnesses reported a man poured gasoline on an unoccupied Tesla Model S and started a fire on a Seattle street. In Las Vegas, several Tesla vehicles were set ablaze early Tuesday outside a Tesla service center where the word “resist” was also painted in red across the building’s front doors. Authorities said at least one person threw Molotov cocktails — crude bombs filled with gasoline or another flammable liquid — and fired several rounds from a weapon into the vehicles. AP © Copyrights 2024 TELANGANA PUBLICATIONS PVT. LTD. All rights reserved.\n                        Powered byVeegam"}, {"id": 6, "link": "https://english.mathrubhumi.com/news/world/tesla-vehicles-set-on-fire-in-las-vegas-1.10434633", "source": "Mathrubhumi English", "title": "Several Tesla vehicles torched in Las Vegas; police probe possible arson", "summary": "Las Vegas, NV: The authorities are investigating a suspected arson attack at a Tesla service center in Las Vegas, Nevada,...", "content": "The Tesla cars set on fire | Photo: Screengrab/Las Vegas Review-Journal Las Vegas, NV: The authorities are investigating a suspected arson attack at a Tesla service center in Las Vegas, Nevada, where an individual allegedly torched multiple vehicles in the early hours of Tuesday. The Metropolitan Police Department noted that the incident happened around 2:45 a.m. at a Tesla Collision Center located in the 6000 block of West Badura Avenue, as per a report from the Las Vegas Review-Journal. The incident marks one of the latest attacks against the electric vehicle maker’s property and vehicles. A video taken of the incident shows several Tesla vehicles burning. The photos from the location also show that the Tesla service centre had been vandalized with graffiti. More details awaited. Click on ‘Get News Alerts’ to get the latest news alerts from"}, {"id": 7, "link": "https://www.marketwatch.com/investing/stock/tsla", "source": "MarketWatch", "title": "TSLA Stock Price | Tesla Inc. Stock Quote (U.S.: Nasdaq)", "summary": "TSLA | Complete Tesla Inc. stock news by MarketWatch. View real-time stock prices and stock quotes for a full financial overview.", "content": "Please enable JS and disable any ad blocker"}, {"id": 8, "link": "https://www.aljazeera.com/podcasts/2025/3/21/tesla-takedown-how-elon-musks-trump-alliance-is-triggering-backlash", "source": "Al Jazeera", "title": "‘Tesla Takedown’: How Elon Musk’s Trump alliance is triggering backlash", "summary": "The backlash to Elon Musk and Donald Trump's alliance is hitting Tesla hard. From boycotts and protests to attacks on cars, showrooms and...", "content": "Tesla stock’s value has plunged as unrest grows over Elon Musk’s ties to Donald Trump. The backlash to Elon Musk and Donald Trump’s alliance is hitting Tesla hard. From boycotts and protests to attacks on cars, showrooms and charging stations, the company’s stock is plummeting. The US Attorney General and Trump called the attacks “domestic terrorism”. What’s driving the fallout, and what impact will it have? In this episode: Episode credits: This episode was produced by Sarí el-Khalili, Sonia Bhagat, and Tamara Khandaker, with Ashish Malhotra, Hanah Shokeir, Melanie Marich, Remas Alhawari, Phillip Lanos, Spencer Cline, and our guest host, Kevin Hirten. It was edited by Noor Wazwaz. Our sound designer is Alex Roldan. Our video editor is Hisham Abu Salah and Mohannad Al-Melhem. Alexandra Locke is The Take’s executive producer. Ney Alvarez is Al Jazeera’s head of audio. Connect with us: @AJEPodcasts onInstagram,X,Facebook,ThreadsandYouTube Follow Al Jazeera English:"}, {"id": 9, "link": "https://www.bbc.com/news/business-61234231", "source": "BBC", "title": "Who is Elon Musk and what is his net worth?", "summary": "The billionaire boss of X (formerly Twitter), Tesla and SpaceX is a controversial figure.", "content": "It seems like not a day goes by without billionaire Elon Musk making headlines. The boss of X (formerly Twitter), Tesla and SpaceX is the world's richest person and has used his platform to make his views known on a vast array of topics. He has charged ahead with human brain chip trials at his firm Neuralink, with three patients currently with implants. He's also played with turning X into a super app andtried to cement his presence in the fast-growing world of artificial intelligence, despite having warned itcould lead to humanity's extinction. And Mr Musk's reach has expanded further still, after Donald Trump's victory in the 2024 US presidential election - in which the Tesla executive played a key but controversial role. The president picked the self-proclaimed \"first buddy\" tolead the newly created Department of Government Efficiency(or Doge - a nod to Musk's favourite cryptocurrency, Dogecoin). Musk has denied a \"hostile takeover\" of the government as his agency, which is not an official government department, implements cuts such asdismantling the United States Agency for International Development(USAID), which distributes tens of billions of dollars' worth of overseas aid every year. Experts have warned of a threat to global health following the move, which could see USAID staffslashed from about 10,000 to fewer than 300 globally. Trump has said Doge would help the administration \"dismantle Government Bureaucracy, slash excess regulations, cut wasteful expenditures and restructure Federal Agencies\". It's something Mr Musk has experience of - he cut a huge number of jobs at Twitter, now X, after buying it. After bursting on to the Silicon Valley scene more than two decades ago, the 53-year-old serial entrepreneur kept the public captivated with his business antics - although his more recent interventions in politics have not been very popular in the UK or Germany. In the UK, Musk accused Prime Minister Sir Keir Starmer of being \"deeply complicit\" in grooming gang \"mass rapes in exchange for votes\" - while Sir Keir accused critics of \"spreading lies and misinformation\". In Germany, Musk has endorsed the far-right Alternative für Deutschland (AfD), and urged Germans to back the party in forthcoming elections. In the UK and Germany, 71% of people said they took a negative view of Musk, with 63% saying they don't think he has much knowledge of national issues,according to YouGov. Born in Pretoria, South Africa, Mr Musk showed his talents for entrepreneurship early, going door-to-door with his brother selling homemade chocolate Easter eggs and developing his first computer game at the age of 12. He has described his childhood as difficult, affected by his parents' divorce, bullying at school and his own difficulty picking up on social cues because of Asperger's Syndrome. At the earliest opportunity, he left home for college, moving to Canada and then the US, where he studied economics and physics at the University of Pennsylvania, an Ivy League college. In a 2010 essay for Marie Claire, his first wife, Justine Musk, a writer whom he met in college and married in 2000, wrote that even before making his millions Mr Musk was \"not a man who takes no for an answer\". \"The will to compete and dominate, that made him so successful in business, did not magically shut off when he came home,\" she recalled, adding that he told her while dancing at their wedding, \"I am the alpha in this relationship.\" After being accepted to a physics graduate degree programme at Stanford University, Mr Musk quickly dropped out and founded two technology start-ups during the \"dotcom boom\" of the 1990s. These included a web software firm and an online banking company that eventually became PayPal, which was sold to eBay in 2002 for $1.5bn (£1.2bn). He ploughed his fortune into a new rocket company, SpaceX - which he aimed to make a cost-effective alternative to Nasa - and a new electric car company, Tesla, where he chaired the board until becoming chief executive in 2008. The two firms are credited with upending their industries, even as they sometimes veered close to financial collapse. More recent business ventures include his takeover of social media platform Twitter in October 2022. He dramatically reduced the size of its workforce including, controversially, cuts to teams responsible for keeping the platform safe; rebranded the company as X; and introduced new premium subscriptions so that the business did not rely on advertising alone for income. Mr Musk's long-term ambition is for X to become an \"everything app\" offering a range of services. However, so far the value of the firm has plunged from the $44bn he originally paid to just $9.4bn, according to some estimates. Since Mr Musk's takeover companies have been choosing to leave the platform in what's been termed \"the great X-odus\". Reports suggest hate speechhas beengrowing under Mr Musk's X tenure, and some firms don't want to be associated with that. He also has ambitions in the AI sector, being an early investor in ChatGPT's parent company before parting ways in 2018, andsetting up his own company xAI\"to understand the true nature of the universe\" in 2023. In February 2024, hesued OpenAI and its boss Sam Altman, saying the firm he helped found had reneged on its non-profit, open source origins by hitching its wagon to Microsoft. A year later, Musk led a takeover bid which wasfirmly rejected by Altman, who suggested a $9.74bn counter-offer for X. \"I'm never hugely convinced that he knows what he wants to do tomorrow,\" says journalist Chris Stokel-Walker of Mr Musk's wide-ranging interests. \"He very much leads by instinct.\" In a 2015 biography, author Ashlee Vance described Mr Musk as \"a confrontational know-it-all\" with an \"abundant ego\". But he also called him an awkward dancer and diffident public speaker. In the press, he's been dubbed both a mad genius and Twitter's biggest troll - known as much for his lofty ambitions as his petty fights, not to mention the more serious lawsuits he and his companies have faced from regulators, investors and others over issues such as racial discrimination and the trustworthiness of his claims. Divorced three times - twice from the same woman, British actress Talulah Riley - Mr Musk is frank about his faults. \"If you list my sins, I sound like the worst person on Earth,\" Mr Musksaid in a TED interview in 2022. \"But if you put those against the things I've done right, it makes much more sense.\" Those contradictions certainly haven't stopped him amassing a fortune. According to Bloomberg'sindextracking the wealth of the world's billionaires, Mr Musk is the richest of them all. It estimates his current net worth to be around $379bn, with his fortune soaring alongside Tesla's share price following Trump's election victory. That's based largely on the value of his shares in Tesla, of which he owns more than 13%. The company's stock soared in value - some say unreasonably - in 2020 as the firm's output increased and it started to deliver regular profits. The shares plunged at the end of 2022, with some blaming the distraction of the Twitter takeover for the fall, though they have since recovered a lot of ground. And throughout 2024 Mr Musk was locked in a legal battle over a $56bn pay package from Tesla with a Delaware judgerejecting his claim to it for a second time in December. Judge Kathaleen McCormick called the pay-out an \"unfathomable sum\", and argued Mr Musk had influenced the company's board and shareholders - with 75% of themvoting to back his pay deal in June. Mr Musk also champions digital currencies and has a hand in several other smaller companies, including tunnel-maker the Boring Company. Mr Musk, who wears the mantle of a workaholic proudly, has often said he's not in business simply to make money - claims he repeated recently with regard to his Twitter takeover. \"Elon only gets involved with things if he feels that they're critically important for some reason... for the sake of society or humanity,\" says friend and Tesla investor Ross Gerber. For a long time Mr Musk, who became a US citizen in 2002, resisted efforts to label his politics - calling himself \"half-Democrat, half-Republican\", \"politically moderate\" and \"independent\". He says he voted for Barack Obama, Hillary Clinton and - reluctantly - Joe Biden, all of them Democrats. But in recent years he's swung behind Donald Trump, who is a Republican. Musktold media company the Daily Wirehis transgender daughter was \"killed\" by transitioning, and that he \"vowed to destroy the woke mind virus\". He is now estranged from his daughter. Musk officially endorsed Trump for a second term in 2024after his attempted assassinationand became one of the campaign's foremost backers and influencers. He became critical of the Democrat party's stance on a number of issues, including the economy, immigration and gun control - decrying many of its policies as \"woke\". Mr Musk also repeatedly claimed that freedom of speech, enshrined in the first amendment of the US Constitution, would be under threat with another Democrat government. He appeared at several Republican rallies in the run-up to the election, raised millions to fund a political action committee to help re-elect Trump, and frequently voiced his support for Trump in posts on X. Mr Musk's America Super PAC also ran acontroversial$1m giveaway to voters in battleground states in the last weeks of the campaign. It was far from his first political controversy. He has shared controversial takes on X about issues facing countries worldwide, such assuggesting the UK was on the cusp of \"civil war\" amid violent unrest in August2024. While Mr Musk provided his Starlink satellite internet service to Ukraine, he also attracted criticism for refusing an emergency request from Kyiv to activate Starlink in Sevastopol,home to a major Russian navy port. In the US, he moved to Texas, complaining of California's regulations and high taxes; has clashed with union organisers; and, in the spring of 2020, decried coronavirus lockdowns as \"fascist\". In the past he has said that he sees his businesses as a form of philanthropy, because they are focused on solving major human issues, such as climate change in the case of Tesla. However, he has since moderated his views on climate change,tweetingit is \"real, just much slower than alarmists claim\". Despite his own interest in artificial intelligence, he has also been one of the most prominent figures expressing concern about the supposed threat to humanity's future that super-intelligent AIs might pose. He has claimed that the rise of artificial intelligence, combined with a declining birth rate, could result in \"not enough people\" being in the world. Mr Musk has had 12 children - six with his first wife, three with Canadian singer Grimes, and three with Shivon Zilis. Following the birth of his twins with Ms Zilis, hetweeted: \"Doing my best to help the underpopulation crisis.\" Additional reporting by Liv McMahon The chatbot has become an \"unfiltered and unhinged\" digital sensation in India. It is the eighth recall involving the pickup since early 2024, shortly after the truck hit the roads. The company is still valued at more than 100 times its earnings - but it faces problems that experts say go beyond questions around its CEO Nasa commentators joked the aquatic mammals are an \"honorary part of the recovery team\" attending to the capsule. Suni Williams and Butch Wilmore have landed near Tallahassee, Florida after a 286-day mission at the International Space Station. Copyright 2025 BBC. All rights reserved.TheBBCisnot responsible for the content of external sites.Read about our approach to external linking."}, {"id": 10, "link": "https://www.nasdaq.com/market-activity/stocks/tsla", "source": "Nasdaq", "title": "Tesla, Inc. Common Stock (TSLA)", "summary": "Discover real-time Tesla, Inc. Common Stock (TSLA) stock prices, quotes, historical data, news, and Insights for informed trading and investment decisions.", "content": "Please try using other words for your search or explore other sections of the website for relevant information. Our team is working diligently to resolve the issue. Thank you for your patience and understanding. Thebid&askrefers to the price that an investor is willing to buy or sell a stock. The bid is the highest amount that a buyer is currently willing to pay, whereas the ask is the lowest amount that a seller is currently willing to sell. The numbers next to the bid/ask are the “size”. The bid size displays the total amount of desired shares... Read More.to buy at that price, and the ask size is the number of shares offered for sale at that price. The data displayed in the quote bar updates every 3 seconds; allowing you to monitor prices in real-time.Thebid-ask spreadcan indicate a stock’s liquidity, which is how easy it is to buy and sell in the marketplace. Often, a smaller spread suggests higher liquidity, meaning more buyers and sellers in the market are willing to negotiate. In contrast, a larger spread suggests lower liquidity, as there are fewer investors willing to negotiate. You can use the bid-ask spread to determine whether to place amarket orderorlimit orderwhen trading, helping you to optimize your price and have a successful order execution.Real-time bid and ask information is powered by Nasdaq Basic, a premier market data solution. This data feed is available via Nasdaq Data Link APIs; to learn more about subscribing, visitNasdaq Data Link's products page.... Read Less. *Data is provided by Barchart.com. Data reflects weightings calculated at the beginning of each month. Data is subject to change. **Green highlights the top performing ETF by % change in the past 100 days. This data feed is not available at this time. Data provided by Nasdaq Data Link, a premier source for financial, economic and alternative datasets. Data Link's cloud-based technology platform allows you to search, discover and access data and analytics for seamless integration via cloud APIs. Register for your free account today atdata.nasdaq.com. © 2025, Nasdaq, Inc. All Rights Reserved. To add symbols:Type a symbol or company name. When the symbol you want to add appears, add it to My Quotes by selecting it and pressing Enter/Return.Copy and paste multiple symbols separated by spaces.These symbols will be available throughout the site during your session. Type a symbol or company name. When the symbol you want to add appears, add it to My Quotes by selecting it and pressing Enter/Return.Copy and paste multiple symbols separated by spaces.These symbols will be available throughout the site during your session. These symbols will be available throughout the site during your session. To add instruments:Type a instrument or company name. When the instrument you want to add appears, add it to My European Quotes by selecting it and pressing Enter/Return.Copy and paste multiple instruments separated by spaces.These instruments will be available throughout the site during your session. Type a instrument or company name. When the instrument you want to add appears, add it to My European Quotes by selecting it and pressing Enter/Return.Copy and paste multiple instruments separated by spaces.These instruments will be available throughout the site during your session. These instruments will be available throughout the site during your session. To add symbols:Type a symbol or company name. When the symbol you want to add appears, add it to Watchlist by selecting it and pressing Enter/Return.Copy and paste multiple symbols separated by spaces.These symbols will be available throughout the site during your session. Type a symbol or company name. When the symbol you want to add appears, add it to Watchlist by selecting it and pressing Enter/Return.Copy and paste multiple symbols separated by spaces.These symbols will be available throughout the site during your session. These symbols will be available throughout the site during your session. Smart Portfolio is supported by our partner TipRanks. By connecting my portfolio to TipRanks Smart Portfolio I agree to theirTerms of Use."}]